<template>
    <div class="mt-[14px]">
        <div class="font-bold">รายการทรัพย์สินทั้งหมด</div>
        <button
            class="bg-[#003765] w-[129px] rounded-[12px] flex justify-center items-center pt-[8px] pb-[8px] pl-[12px] pr-[12px] mt-[14px]">
            <div class="flex">
                <div class="flex justify-center items-center "><svg width="14" height="13" viewBox="0 0 14 13" fill="none"
                        xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M6.99968 12.6875C6.8048 12.6875 6.64155 12.6216 6.50993 12.4898C6.37831 12.3581 6.3125 12.1948 6.3125 12V7.18746H1.49998C1.30519 7.18746 1.14191 7.12155 1.01016 6.98973C0.878385 6.8579 0.8125 6.69455 0.8125 6.49968C0.8125 6.3048 0.878385 6.14155 1.01016 6.00993C1.14191 5.87831 1.30519 5.8125 1.49998 5.8125H6.3125V0.999977C6.3125 0.805185 6.37841 0.641904 6.51023 0.510133C6.64206 0.378378 6.80541 0.3125 7.00028 0.3125C7.19516 0.3125 7.35841 0.378378 7.49003 0.510133C7.62165 0.641904 7.68745 0.805185 7.68745 0.999977V5.8125H12.5C12.6948 5.8125 12.8581 5.87841 12.9898 6.01023C13.1216 6.14206 13.1875 6.30541 13.1875 6.50028C13.1875 6.69516 13.1216 6.85841 12.9898 6.99003C12.8581 7.12164 12.6948 7.18746 12.5 7.18746H7.68745V12C7.68745 12.1948 7.62155 12.3581 7.48973 12.4898C7.3579 12.6216 7.19455 12.6875 6.99968 12.6875Z"
                            fill="white" />
                    </svg>
                </div>
                <div class="text-[white] ml-[4px]" @click="add_on = true, is_edit = false">เพิ่มทรัพย์สิน</div>
            </div>
        </button>
        <div class="grid grid-cols-3 w-[100%] gap-4 mt-[14px]">
            <div class="h-[78px] bg-[#F3F8FD] rounded-[12px] pl-[4px] pr-[12px] cursor-pointer"
                @click="is_edit = true, getDetailFacilities(item.id)" v-for="item in items">
                <div class="flex justify-between items-center">
                    <div class="flex justify-center items-center">
                        <div>
                            <svg width="70" height="82" viewBox="0 0 70 82" fill="none" xmlns="http://www.w3.org/2000/svg"
                                v-if="item.attributes.title == 'ทีวี'">
                                <g filter="url(#filter0_d_2182_22179)">
                                    <rect x="6" y="6" width="54" height="66" rx="12" fill="#165D98" />
                                    <mask id="mask0_2182_22179" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="11"
                                        y="17" width="44" height="44">
                                        <rect x="11" y="17" width="44" height="44" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_2182_22179)">
                                        <path
                                            d="M21.4028 50.9166L20.4474 53.6242C20.4 53.7572 20.317 53.868 20.1985 53.9566C20.08 54.0453 19.9412 54.0896 19.7822 54.0896H19.5777C19.396 54.0896 19.2369 54.0209 19.1006 53.8834C18.9643 53.7459 18.8961 53.5854 18.8961 53.4021V50.9166C17.9848 50.9166 17.2046 50.5921 16.5556 49.943C15.9065 49.294 15.582 48.5138 15.582 47.6025V28.5641C15.582 27.6527 15.9065 26.8725 16.5556 26.2235C17.2046 25.5745 17.9848 25.25 18.8961 25.25H47.1012C48.0125 25.25 48.7927 25.5745 49.4417 26.2235C50.0908 26.8725 50.4153 27.6527 50.4153 28.5641V47.6025C50.4153 48.5145 50.0908 49.2953 49.4417 49.9448C48.7927 50.5943 48.0125 50.919 47.1012 50.919V53.4479C47.1012 53.628 47.0393 53.78 46.9154 53.9039C46.7916 54.0277 46.6396 54.0896 46.4595 54.0896H46.2127C46.0717 54.0896 45.9425 54.0504 45.8249 53.9719C45.7074 53.8934 45.6251 53.7869 45.5781 53.6524L44.658 50.9166H21.4028ZM18.8961 48.1666H47.1012C47.2657 48.1666 47.4009 48.1137 47.5067 48.0079C47.6124 47.9022 47.6653 47.767 47.6653 47.6025V28.5641C47.6653 28.3996 47.6124 28.2644 47.5067 28.1586C47.4009 28.0528 47.2657 28 47.1012 28H18.8961C18.7316 28 18.5964 28.0528 18.4907 28.1586C18.3849 28.2644 18.332 28.3996 18.332 28.5641V47.6025C18.332 47.767 18.3849 47.9022 18.4907 48.0079C18.5964 48.1137 18.7316 48.1666 18.8961 48.1666Z"
                                            fill="white" />
                                    </g>
                                </g>
                                <defs>
                                    <filter id="filter0_d_2182_22179" x="0" y="0" width="70" height="82"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                        <feOffset dx="2" dy="2" />
                                        <feGaussianBlur stdDeviation="4" />
                                        <feComposite in2="hardAlpha" operator="out" />
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.15 0" />
                                        <feBlend mode="normal" in2="BackgroundImageFix"
                                            result="effect1_dropShadow_2182_22179" />
                                        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_2182_22179"
                                            result="shape" />
                                    </filter>
                                </defs>
                            </svg>
                            <svg width="70" height="82" viewBox="0 0 70 82" fill="none" xmlns="http://www.w3.org/2000/svg"
                                v-else-if="item.attributes.title == 'ตู้เย็น'">
                                <g filter="url(#filter0_d_2182_22211)">
                                    <rect x="6" y="6" width="54" height="66" rx="12" fill="#165D98" />
                                    <mask id="mask0_2182_22211" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="11"
                                        y="17" width="44" height="44">
                                        <rect x="11" y="17" width="44" height="44" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_2182_22211)">
                                        <path
                                            d="M16.9564 50.9167C16.5667 50.9167 16.2402 50.785 15.9769 50.5214C15.7137 50.2579 15.582 49.9313 15.582 49.5417V40.8334C15.582 40.1495 15.7442 39.4861 16.0686 38.8432C16.3929 38.2004 16.8419 37.6721 17.4154 37.2585V32.5835C17.4154 31.3025 17.859 30.2184 18.7463 29.3312C19.6336 28.4439 20.7177 28.0002 21.9987 28.0002H29.7904C30.4579 28.0002 31.0561 28.1301 31.5849 28.3898C32.1137 28.6495 32.585 29.0086 32.9987 29.4669C33.4123 29.0086 33.8836 28.6495 34.4124 28.3898C34.9413 28.1301 35.5394 28.0002 36.2069 28.0002H43.9987C45.2796 28.0002 46.3637 28.4439 47.251 29.3312C48.1383 30.2184 48.5819 31.3025 48.5819 32.5835V37.2585C49.1554 37.6721 49.6044 38.2004 49.9287 38.8432C50.2531 39.4861 50.4153 40.1495 50.4153 40.8334V49.5417C50.4153 49.9313 50.2834 50.2579 50.0198 50.5214C49.7561 50.785 49.4294 50.9167 49.0397 50.9167C48.6499 50.9167 48.3234 50.785 48.0602 50.5214C47.7969 50.2579 47.6653 49.9313 47.6653 49.5417V47.2501H18.332V49.5417C18.332 49.9313 18.2002 50.2579 17.9365 50.5214C17.6729 50.785 17.3462 50.9167 16.9564 50.9167ZM34.3736 36.2502H45.832V32.5835C45.832 32.064 45.6563 31.6286 45.3049 31.2772C44.9535 30.9258 44.5181 30.7502 43.9987 30.7502H36.2069C35.6875 30.7502 35.2521 30.9258 34.9007 31.2772C34.5493 31.6286 34.3736 32.064 34.3736 32.5835V36.2502ZM20.1653 36.2502H31.6237V32.5835C31.6237 32.064 31.448 31.6286 31.0966 31.2772C30.7452 30.9258 30.3098 30.7502 29.7904 30.7502H21.9987C21.4792 30.7502 21.0438 30.9258 20.6924 31.2772C20.341 31.6286 20.1653 32.064 20.1653 32.5835V36.2502ZM18.332 44.5001H47.6653V40.8334C47.6653 40.314 47.4896 39.8786 47.1382 39.5272C46.7869 39.1758 46.3514 39.0001 45.832 39.0001H20.1653C19.6459 39.0001 19.2105 39.1758 18.8591 39.5272C18.5077 39.8786 18.332 40.314 18.332 40.8334V44.5001Z"
                                            fill="white" />
                                    </g>
                                </g>
                                <defs>
                                    <filter id="filter0_d_2182_22211" x="0" y="0" width="70" height="82"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                        <feOffset dx="2" dy="2" />
                                        <feGaussianBlur stdDeviation="4" />
                                        <feComposite in2="hardAlpha" operator="out" />
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.15 0" />
                                        <feBlend mode="normal" in2="BackgroundImageFix"
                                            result="effect1_dropShadow_2182_22211" />
                                        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_2182_22211"
                                            result="shape" />
                                    </filter>
                                </defs>
                            </svg>
                            <svg width="70" height="78" viewBox="0 0 70 78" fill="none" xmlns="http://www.w3.org/2000/svg"
                                v-else>
                                <g filter="url(#filter0_d_3063_26009)">
                                    <rect x="6" y="6" width="54" height="66" rx="12" fill="#165D98" />
                                    <ellipse cx="20.1667" cy="39.0002" rx="3.66667" ry="3.66667" fill="white" />
                                    <circle cx="33.0006" cy="39.0002" r="3.66667" fill="white" />
                                    <ellipse cx="45.8327" cy="39.0002" rx="3.66667" ry="3.66667" fill="white" />
                                </g>
                                <defs>
                                    <filter id="filter0_d_3063_26009" x="0" y="0" width="70" height="82"
                                        filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                        <feFlood flood-opacity="0" result="BackgroundImageFix" />
                                        <feColorMatrix in="SourceAlpha" type="matrix"
                                            values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha" />
                                        <feOffset dx="2" dy="2" />
                                        <feGaussianBlur stdDeviation="4" />
                                        <feComposite in2="hardAlpha" operator="out" />
                                        <feColorMatrix type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0.15 0" />
                                        <feBlend mode="normal" in2="BackgroundImageFix"
                                            result="effect1_dropShadow_3063_26009" />
                                        <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_3063_26009"
                                            result="shape" />
                                    </filter>
                                </defs>
                            </svg>
                        </div>
                        <div>
                            <div class="text-[18px] font-bold">{{ item.attributes.title }}</div>
                            <div class="text-[#141629] mt-[8px]">กรณีเสียหายค่าปรับ {{ item.attributes.price }} บาท</div>
                        </div>
                    </div>

                    <div>
                        <svg width="48" height="31" viewBox="0 0 48 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path
                                d="M3.02 27.15C2.22 27.15 1.59 26.9233 1.13 26.47C0.676667 26.0167 0.45 25.35 0.45 24.47C0.45 23.8633 0.533333 23.3367 0.7 22.89C0.866667 22.4433 1.09333 22.1 1.38 21.86C1.67333 21.62 2.00667 21.5 2.38 21.5C2.88667 21.5 3.24333 21.7033 3.45 22.11C3.56333 21.9033 3.73333 21.75 3.96 21.65C4.18667 21.55 4.44 21.5 4.72 21.5C5.18 21.5 5.52333 21.6467 5.75 21.94C5.98333 22.2333 6.1 22.6267 6.1 23.12V27H5.08V23.19C5.08 22.89 5.03333 22.67 4.94 22.53C4.84667 22.3833 4.68667 22.31 4.46 22.31C4.08 22.31 3.84333 22.5167 3.75 22.93H3.15C3.11667 22.7233 3.05 22.57 2.95 22.47C2.85667 22.3633 2.72 22.31 2.54 22.31C2.22667 22.31 1.97 22.4967 1.77 22.87C1.57667 23.2433 1.48 23.7767 1.48 24.47C1.48 25.11 1.62 25.5833 1.9 25.89C2.18 26.1967 2.61 26.35 3.19 26.35C3.44333 26.35 3.67667 26.3167 3.89 26.25V27.04C3.65667 27.1133 3.36667 27.15 3.02 27.15ZM4.21805 20.86C3.93138 20.86 3.72471 20.79 3.59805 20.65C3.46471 20.5033 3.39805 20.2867 3.39805 20V19.48H4.31805V19.88C4.31805 19.9933 4.34138 20.07 4.38805 20.11C4.42805 20.15 4.50805 20.17 4.62805 20.17H6.98805V20.86H4.21805ZM4.42805 18.2C4.42805 18.12 4.41471 18.0667 4.38805 18.04C4.36138 18.0067 4.30471 17.99 4.21805 17.99H3.79805V17.31H4.51805C4.90471 17.31 5.09805 17.48 5.09805 17.82V18.14H6.78805V18.77H4.42805V18.2ZM7.19805 22.32H8.21805L9.48805 26.2C10.1147 26.2 10.598 26.0267 10.938 25.68C11.278 25.3333 11.448 24.8433 11.448 24.21C11.448 23.5833 11.3314 23.11 11.098 22.79C10.8647 22.47 10.4914 22.31 9.97805 22.31C9.73805 22.31 9.50471 22.34 9.27805 22.4V21.61C9.54471 21.5367 9.83471 21.5 10.148 21.5C10.908 21.5 11.488 21.74 11.888 22.22C12.288 22.7 12.488 23.3633 12.488 24.21C12.488 24.79 12.3614 25.29 12.108 25.71C11.8614 26.13 11.5247 26.45 11.098 26.67C10.6714 26.89 10.198 27 9.67805 27H8.71805L7.19805 22.32ZM13.5895 23.69C13.5895 22.9967 13.8161 22.46 14.2695 22.08C14.7228 21.6933 15.3461 21.5 16.1395 21.5C16.9261 21.5 17.5461 21.69 17.9995 22.07C18.4528 22.45 18.6795 22.99 18.6795 23.69V27H17.6595V23.66C17.6595 23.2067 17.5261 22.87 17.2595 22.65C16.9928 22.4233 16.6195 22.31 16.1395 22.31C15.6528 22.31 15.2761 22.4233 15.0095 22.65C14.7428 22.87 14.6095 23.2067 14.6095 23.66V24.68C14.6961 24.52 14.8328 24.3933 15.0195 24.3C15.2061 24.2 15.4261 24.15 15.6795 24.15H16.4795V24.99H15.5995C15.3195 24.99 15.0828 25.09 14.8895 25.29C14.7028 25.4833 14.6095 25.7067 14.6095 25.96V27H13.5895V23.69ZM17.6862 19.19H18.6962V20.86H17.6862V19.19ZM21.8562 23.54C21.8562 23.1133 21.7695 22.8033 21.5962 22.61C21.4228 22.41 21.1162 22.31 20.6762 22.31C20.2495 22.31 19.8495 22.4033 19.4762 22.59V21.79C19.6362 21.71 19.8428 21.6433 20.0962 21.59C20.3562 21.53 20.6128 21.5 20.8662 21.5C21.5395 21.5 22.0428 21.6833 22.3762 22.05C22.7095 22.41 22.8762 22.93 22.8762 23.61V27H21.8562V23.54ZM26.3754 27.15C25.8954 27.15 25.4787 27.0667 25.1254 26.9C24.7721 26.7333 24.4987 26.5 24.3054 26.2C24.1187 25.8933 24.0254 25.5433 24.0254 25.15V24.81C24.0254 24.5833 24.0721 24.3767 24.1654 24.19C24.2587 24.0033 24.3954 23.7867 24.5754 23.54C24.7021 23.3733 24.7954 23.2367 24.8554 23.13C24.9154 23.0167 24.9454 22.91 24.9454 22.81C24.9454 22.6833 24.9121 22.5933 24.8454 22.54C24.7854 22.4867 24.6821 22.46 24.5354 22.46H23.9754V21.65H25.0254C25.3187 21.65 25.5487 21.7367 25.7154 21.91C25.8887 22.0767 25.9754 22.3 25.9754 22.58C25.9754 22.7733 25.9354 22.9533 25.8554 23.12C25.7754 23.28 25.6554 23.4767 25.4954 23.71C25.3354 23.95 25.2187 24.1433 25.1454 24.29C25.0787 24.4367 25.0454 24.5967 25.0454 24.77V25.14C25.0454 25.5267 25.1554 25.8267 25.3754 26.04C25.6021 26.2467 25.9354 26.35 26.3754 26.35C26.8154 26.35 27.1421 26.2433 27.3554 26.03C27.5687 25.81 27.6754 25.5033 27.6754 25.11V21.65H28.6954V24.94C28.6954 25.6267 28.4921 26.1667 28.0854 26.56C27.6787 26.9533 27.1087 27.15 26.3754 27.15ZM26.5457 20.23C26.5457 20.15 26.5324 20.0933 26.5057 20.06C26.4724 20.0267 26.4157 20.01 26.3357 20.01H25.8857V19.29H26.6357C26.849 19.29 27.0057 19.3433 27.1057 19.45C27.199 19.55 27.2457 19.6767 27.2457 19.83V20.18H29.2957V20.86H26.5457V20.23ZM31.9757 27.15C31.5624 27.15 31.1624 27.1 30.7757 27C30.389 26.9067 30.0624 26.7733 29.7957 26.6V23.94H32.0157V24.76H30.8157V26.09C31.1024 26.2633 31.489 26.35 31.9757 26.35C32.6157 26.35 33.1024 26.1733 33.4357 25.82C33.7757 25.4667 33.9457 24.9533 33.9457 24.28C33.9457 23.6067 33.7724 23.11 33.4257 22.79C33.0857 22.47 32.5257 22.31 31.7457 22.31C31.3924 22.31 31.0457 22.3467 30.7057 22.42C30.3657 22.4867 30.079 22.5967 29.8457 22.75V21.94C30.1057 21.7933 30.4124 21.6833 30.7657 21.61C31.119 21.5367 31.499 21.5 31.9057 21.5C32.9057 21.5 33.669 21.7433 34.1957 22.23C34.7224 22.7167 34.9857 23.4 34.9857 24.28C34.9857 25.1667 34.7224 25.8667 34.1957 26.38C33.6757 26.8933 32.9357 27.15 31.9757 27.15ZM38.9995 27.15C38.6328 27.15 38.2828 27.0767 37.9495 26.93C37.6228 26.7833 37.3295 26.5667 37.0695 26.28V27H36.0895V21.65H37.1095V25.43C37.5028 26.0433 38.0428 26.35 38.7295 26.35C39.1628 26.35 39.4895 26.25 39.7095 26.05C39.9361 25.8433 40.0495 25.54 40.0495 25.14V21.65H41.0695V25.18C41.0695 25.76 40.8861 26.2333 40.5195 26.6C40.1528 26.9667 39.6461 27.15 38.9995 27.15ZM39.8287 29.71C39.4154 29.71 39.0954 29.6233 38.8687 29.45C38.6354 29.2767 38.5187 29.0433 38.5187 28.75V28.48C38.5187 28.3867 38.5054 28.3233 38.4787 28.29C38.4521 28.2633 38.3954 28.25 38.3087 28.25H37.9687V27.57H38.8487C39.0287 27.57 39.1521 27.61 39.2188 27.69C39.2854 27.77 39.3187 27.9 39.3187 28.08V28.65C39.3187 28.9433 39.4787 29.09 39.7987 29.09C40.1121 29.09 40.2687 28.9433 40.2687 28.65V27.57H41.0687V28.72C41.0687 29.0133 40.9621 29.25 40.7487 29.43C40.5287 29.6167 40.2221 29.71 39.8287 29.71ZM44.1088 27.15C43.5154 27.15 43.0421 27.0033 42.6888 26.71C42.3421 26.41 42.1688 25.9867 42.1688 25.44C42.1688 24.9 42.3621 24.47 42.7488 24.15C43.1421 23.83 43.6721 23.67 44.3388 23.67C44.9988 23.67 45.5921 23.7933 46.1188 24.04V23.63C46.1188 23.17 45.9921 22.8367 45.7388 22.63C45.4921 22.4167 45.0788 22.31 44.4988 22.31C44.1788 22.31 43.8654 22.34 43.5588 22.4C43.2521 22.46 42.9854 22.5433 42.7588 22.65V21.85C42.9654 21.75 43.2454 21.6667 43.5988 21.6C43.9588 21.5333 44.3088 21.5 44.6488 21.5C45.4821 21.5 46.1054 21.69 46.5188 22.07C46.9321 22.45 47.1388 22.9633 47.1388 23.61V27H46.1188V24.85C45.6321 24.6033 45.0754 24.48 44.4488 24.48C44.0154 24.48 43.6954 24.56 43.4888 24.72C43.2888 24.88 43.1887 25.12 43.1887 25.44C43.1887 26.0467 43.5787 26.35 44.3587 26.35C44.5988 26.35 44.8088 26.3167 44.9888 26.25V27.04C44.7488 27.1133 44.4554 27.15 44.1088 27.15Z"
                                fill="#8396A6" />
                            <mask id="mask0_3339_17059" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="16" y="0"
                                width="16" height="16">
                                <rect x="16" width="16" height="16" fill="#D9D9D9" />
                            </mask>
                            <g mask="url(#mask0_3339_17059)">
                                <path
                                    d="M25.0073 14.3333H22.9881C22.8385 14.3333 22.709 14.283 22.5996 14.1826C22.4902 14.0822 22.4244 13.9572 22.4022 13.8076L22.2086 12.3025C22.03 12.2427 21.8469 12.1589 21.6592 12.0512C21.4716 11.9435 21.3039 11.8281 21.156 11.705L19.7637 12.2922C19.621 12.3478 19.4793 12.3533 19.3387 12.3089C19.1981 12.2645 19.0877 12.1764 19.0073 12.0448L18.0048 10.2987C17.9244 10.167 17.8999 10.0264 17.9311 9.87688C17.9622 9.7273 18.0381 9.60679 18.1586 9.51534L19.3637 8.60379C19.3484 8.50465 19.3375 8.40508 19.331 8.30508C19.3246 8.20508 19.3214 8.1055 19.3214 8.00636C19.3214 7.91148 19.3246 7.81511 19.331 7.71724C19.3375 7.61938 19.3484 7.51233 19.3637 7.39609L18.1586 6.48454C18.0381 6.3931 17.9622 6.27259 17.9311 6.12301C17.8999 5.97344 17.9244 5.83285 18.0048 5.70123L19.0073 3.96793C19.0808 3.82946 19.1885 3.73971 19.3304 3.69869C19.4723 3.65767 19.6146 3.66494 19.7573 3.72049L21.1496 4.30126C21.3103 4.1739 21.4819 4.05745 21.6644 3.95189C21.8468 3.84633 22.0261 3.76149 22.2022 3.69739L22.4022 2.19228C22.4244 2.0427 22.4902 1.9177 22.5996 1.81728C22.709 1.71684 22.8385 1.66663 22.9881 1.66663H25.0073C25.1569 1.66663 25.2874 1.71684 25.3989 1.81728C25.5105 1.9177 25.5774 2.0427 25.5996 2.19228L25.7932 3.70381C25.9932 3.77645 26.1742 3.86128 26.3361 3.95829C26.4981 4.0553 26.6616 4.16963 26.8265 4.30126L28.2445 3.72049C28.3872 3.66494 28.5278 3.65831 28.6663 3.70061C28.8047 3.74292 28.9141 3.82989 28.9945 3.96151L29.997 5.70123C30.0774 5.83285 30.1019 5.97344 30.0707 6.12301C30.0395 6.27259 29.9637 6.3931 29.8432 6.48454L28.6124 7.41531C28.6363 7.52301 28.6494 7.62365 28.6515 7.71724C28.6536 7.81083 28.6547 7.90507 28.6547 7.99994C28.6547 8.09054 28.6526 8.18264 28.6483 8.27623C28.644 8.36982 28.6286 8.47687 28.6021 8.59739L29.8201 9.51534C29.9449 9.60252 30.0218 9.72196 30.0509 9.87366C30.0799 10.0254 30.0543 10.167 29.9739 10.2987L28.9714 12.0345C28.891 12.1661 28.7789 12.2548 28.6349 12.3006C28.4908 12.3463 28.3475 12.3414 28.2047 12.2858L26.8265 11.6986C26.6616 11.8303 26.4932 11.9467 26.3214 12.048C26.1496 12.1493 25.9735 12.232 25.7932 12.2961L25.5996 13.8076C25.5774 13.9572 25.5105 14.0822 25.3989 14.1826C25.2874 14.283 25.1569 14.3333 25.0073 14.3333ZM24.0086 9.99993C24.5633 9.99993 25.0353 9.80527 25.4246 9.41596C25.8139 9.02664 26.0086 8.55463 26.0086 7.99994C26.0086 7.44525 25.8139 6.97325 25.4246 6.58393C25.0353 6.19462 24.5633 5.99996 24.0086 5.99996C23.4471 5.99996 22.9733 6.19462 22.5874 6.58393C22.2016 6.97325 22.0086 7.44525 22.0086 7.99994C22.0086 8.55463 22.2016 9.02664 22.5874 9.41596C22.9733 9.80527 23.4471 9.99993 24.0086 9.99993ZM24.0086 8.99994C23.7308 8.99994 23.4947 8.90272 23.3002 8.70828C23.1058 8.51383 23.0086 8.27772 23.0086 7.99994C23.0086 7.72217 23.1058 7.48605 23.3002 7.29161C23.4947 7.09717 23.7308 6.99994 24.0086 6.99994C24.2864 6.99994 24.5225 7.09717 24.7169 7.29161C24.9114 7.48605 25.0086 7.72217 25.0086 7.99994C25.0086 8.27772 24.9114 8.51383 24.7169 8.70828C24.5225 8.90272 24.2864 8.99994 24.0086 8.99994ZM23.3342 13.3333H24.6445L24.8842 11.5474C25.2244 11.4585 25.5353 11.3322 25.8169 11.1685C26.0985 11.0049 26.3701 10.7944 26.6317 10.5371L28.2881 11.2333L28.9445 10.0999L27.4983 9.01019C27.5539 8.83755 27.5917 8.66832 27.6118 8.50251C27.6319 8.3367 27.6419 8.16918 27.6419 7.99994C27.6419 7.82644 27.6319 7.65892 27.6118 7.49738C27.5917 7.33584 27.5539 7.17089 27.4983 7.00251L28.9573 5.89994L28.3009 4.76661L26.6252 5.47303C26.4022 5.23456 26.1349 5.02388 25.8233 4.84098C25.5118 4.65807 25.1966 4.52858 24.8778 4.45251L24.6676 2.66661H23.3445L23.124 4.44609C22.7838 4.52644 22.4697 4.64951 22.1817 4.81533C21.8936 4.98114 21.6188 5.19482 21.3573 5.45636L19.7009 4.76661L19.0445 5.89994L20.4842 6.97303C20.4287 7.13114 20.3898 7.29567 20.3676 7.46661C20.3453 7.63755 20.3342 7.81747 20.3342 8.00636C20.3342 8.17986 20.3453 8.34994 20.3676 8.51661C20.3898 8.68328 20.4265 8.8478 20.4778 9.01019L19.0445 10.0999L19.7009 11.2333L21.3509 10.5333C21.6039 10.7931 21.8744 11.0059 22.1624 11.1717C22.4505 11.3376 22.7688 11.4649 23.1176 11.5538L23.3342 13.3333Z"
                                    fill="#8396A6" />
                            </g>
                        </svg>
                    </div>
                </div>
            </div>
            <b-modal centered v-model="create" size="xl" hide-backdrop hide-header-close hide-header hide-footer
                class="p-[-20px] text-custom">
                <div>
                    <div class="flex justify-between pl-[20px] pr-[20px]">
                        <div class="text-custom flex justify-center items-center text-[18px] font-bold">แก้ไขข้อมูลทรัพย์สิน
                        </div>
                        <div @click="create = false" class="cursor-pointer">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <mask id="mask0_417_4814" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                    width="24" height="24">
                                    <rect width="24" height="24" fill="#D9D9D9" />
                                </mask>
                                <g mask="url(#mask0_417_4814)">
                                    <path
                                        d="M12.0005 13.0538L6.92737 18.1269C6.78892 18.2654 6.61489 18.3362 6.40527 18.3394C6.19567 18.3426 6.01844 18.2718 5.87357 18.1269C5.72869 17.982 5.65625 17.8064 5.65625 17.6C5.65625 17.3936 5.72869 17.218 5.87357 17.0731L10.9466 12L5.87357 6.92689C5.73511 6.78844 5.66427 6.6144 5.66107 6.40479C5.65786 6.19519 5.72869 6.01795 5.87357 5.87309C6.01844 5.7282 6.19407 5.65576 6.40047 5.65576C6.60687 5.65576 6.78251 5.7282 6.92737 5.87309L12.0005 10.9462L17.0736 5.87309C17.212 5.73462 17.3861 5.66379 17.5957 5.66059C17.8053 5.65737 17.9825 5.7282 18.1274 5.87309C18.2723 6.01795 18.3447 6.19359 18.3447 6.39999C18.3447 6.60639 18.2723 6.78202 18.1274 6.92689L13.0543 12L18.1274 17.0731C18.2658 17.2115 18.3367 17.3856 18.3399 17.5952C18.3431 17.8048 18.2723 17.982 18.1274 18.1269C17.9825 18.2718 17.8069 18.3442 17.6005 18.3442C17.3941 18.3442 17.2184 18.2718 17.0736 18.1269L12.0005 13.0538Z"
                                        fill="#5C6B79" />
                                </g>
                            </svg>
                        </div>
                    </div>
                    <!-- <div class="w-[100%] h-[1px]  mt-[24px] mb-[14px] bg-gray-200 border-0 dark:bg-gray-700"></div> -->
                    <div class="pl-[20px] pr-[20px] mt-[24px]">
                        <div class="flex w-[100%]">
                            <div class="w-[20%]">
                                <div class="text-custom text-[#5C6B79]">ชื่อทรัพย์สิน</div>
                            </div>
                            <div class="w-[80%] flex">
                                <input class="h-[28px] w-[280px] bg-[#F3F8FD] rounded-[12px]  flex justify-start"
                                    type="input" v-model="facilities.title" />
                            </div>
                        </div>
                        <div class="flex w-[100%] mt-[14px]">
                            <div class="w-[20%]">
                                <div class="text-custom text-[#5C6B79]">ค่าปรับ (กรณีเสียหาย)</div>
                            </div>
                            <div class="w-[80%]">
                                <div class="flex">
                                    <input class="h-[28px] w-[100px] bg-[#F3F8FD] rounded-[12px]  flex justify-start"
                                        type="input" v-model="facilities.price" />
                                    <span class="text-custom flex items-center ml-[8px]">บาท</span>
                                </div>

                            </div>
                        </div>
                        <!-- <div class="flex w-[100%] mt-[14px]">
                            <div class="w-[20%]">
                                <div class="text-custom text-[#5C6B79]">สถานะทรัพย์สิน</div>
                            </div>
                            <div class="w-[80%] flex">
                                <vs-radio v-model="facilities.remain" :val="true">
                                    <div class="text-custom">มี</div>
                                </vs-radio>
                                <vs-radio v-model="facilities.remain" :val="false" class="ml-[8px]">
                                    <div class="text-custom">ไม่มี</div>
                                </vs-radio>
                            </div>
                        </div>
                        <div class="flex w-[100%] mt-[14px]">
                            <div class="w-[20%]">
                                <div class="text-custom text-[#5C6B79]">สภาพทรัพย์สิน</div>
                            </div>
                            <div class="w-[80%] flex">
                                <vs-radio v-model="facilities.status" :val="true">
                                    <div class="text-custom">ไม่เสียหาย</div>
                                </vs-radio>
                                <vs-radio v-model="facilities.status" :val="false" class="ml-[8px]">
                                    <div class="text-custom">เสียหาย</div>
                                </vs-radio>
                            </div>
                        </div> -->
                        <div class="flex w-[100%] mt-[14px]">
                            <div class="w-[20%]">
                                <div class="text-custom text-[#5C6B79]">หมายเหตุ</div>
                            </div>
                            <div class="w-[80%] flex">
                                <input class="h-[28px] w-[280px] bg-[#F3F8FD] rounded-[12px]  flex justify-start"
                                    type="input" v-model="facilities.note" />
                            </div>
                        </div>
                        <!-- <div class="flex w-[100%] mt-[14px]">
                            <div class="w-[20%]">
                                <div class="text-custom text-[#5C6B79]">รูปภาพก่อนเข้าพัก</div>
                            </div>
                            <div class="flex">
                                <input class="h-[28px] w-[120px] rounded-[12px] border flex justify-start" id="upload"
                                    hidden type="file" />
                                <label for="upload">
                                    <div
                                        class="h-[28px] w-[120px] flex justify-center text-custom items-center bg-[#165D98] text-[14px] text-[white] rounded-[12px] cursor-pointer">
                                        อัพโหลดรูปภาพ</div>
                                </label>
                                <div
                                    class="text-[#5C6B79] text-custom flex justify-center items-center ml-[8px] text-[12px]">
                                    ยังไม่ได้เลือกไฟล์</div>
                            </div>
                        </div> -->
                    </div>
                    <div class="flex justify-between mt-[34px] mb-[14px]">
                        <div>
                            <div>
                                <vs-button @click="delectFacilities(facilities.id)" color="#D44769">
                                    <div class="text-custom">ลบรายการนี้</div>
                                </vs-button>
                            </div>
                        </div>
                        <div class="flex">
                            <div>
                                <vs-button dark shadow @click="create = false">
                                    <div class="text-custom">ยกเลิก</div>
                                </vs-button>
                            </div>
                            <div>
                                <vs-button @click="EditFacilities()" color="#003765">
                                    <div class="text-custom">บันทึก</div>
                                </vs-button>
                            </div>
                        </div>
                    </div>
                </div>
            </b-modal>
            <b-modal centered v-model="add_on" size="xl" hide-backdrop hide-header-close hide-header hide-footer
                class="p-[-20px] text-custom">
                <div>
                    <div class="flex justify-between pl-[20px] pr-[20px]">
                        <div class="text-custom flex justify-center items-center text-[18px]">
                            <div>เพิ่มทรัพย์สิน</div>
                            <div class="font-bold ml-[4px]">{{ name_user }} </div>
                            <div class="ml-[4px]">ห้อง</div>
                            <div class="font-bold ml-[4px]">{{ $route.query.number_room }} </div>
                        </div>
                        <div @click="add_on = false" class="cursor-pointer">
                            <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <mask id="mask0_417_4814" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                    width="24" height="24">
                                    <rect width="24" height="24" fill="#D9D9D9" />
                                </mask>
                                <g mask="url(#mask0_417_4814)">
                                    <path
                                        d="M12.0005 13.0538L6.92737 18.1269C6.78892 18.2654 6.61489 18.3362 6.40527 18.3394C6.19567 18.3426 6.01844 18.2718 5.87357 18.1269C5.72869 17.982 5.65625 17.8064 5.65625 17.6C5.65625 17.3936 5.72869 17.218 5.87357 17.0731L10.9466 12L5.87357 6.92689C5.73511 6.78844 5.66427 6.6144 5.66107 6.40479C5.65786 6.19519 5.72869 6.01795 5.87357 5.87309C6.01844 5.7282 6.19407 5.65576 6.40047 5.65576C6.60687 5.65576 6.78251 5.7282 6.92737 5.87309L12.0005 10.9462L17.0736 5.87309C17.212 5.73462 17.3861 5.66379 17.5957 5.66059C17.8053 5.65737 17.9825 5.7282 18.1274 5.87309C18.2723 6.01795 18.3447 6.19359 18.3447 6.39999C18.3447 6.60639 18.2723 6.78202 18.1274 6.92689L13.0543 12L18.1274 17.0731C18.2658 17.2115 18.3367 17.3856 18.3399 17.5952C18.3431 17.8048 18.2723 17.982 18.1274 18.1269C17.9825 18.2718 17.8069 18.3442 17.6005 18.3442C17.3941 18.3442 17.2184 18.2718 17.0736 18.1269L12.0005 13.0538Z"
                                        fill="#5C6B79" />
                                </g>
                            </svg>
                        </div>
                    </div>
                    <!-- <div class="w-[100%] h-[1px]  mt-[24px] mb-[14px] bg-gray-200 border-0 dark:bg-gray-700"></div> -->
                    <div class="pl-[20px] pr-[20px] mt-[24px]">
                        <div class="text-custom">
                            <div class="mt-[14px] mb-[14px]">
                                <div class="text-[#141629] font-bold text-[16px]">เลือกทรัพย์สิน</div>
                                <div class="grid grid-cols-8 w-[100%] gap-2 mt-[14px]">
                                    <!-- <div v-for="data in otherOfBuilding">
                                        <div class="h-[32px] bg-[#DEEAF5] rounded-[12px] flex items-center justify-between pl-[8px] pr-[8px]"
                                            @click=" room.status ? '' : room_move.id_room = room.id, room_move.Number = room.RoomNumber, confirm = true, tab = ''"
                                            :class="room.status ? 'bg-[#E8F0F8] text-[#B9CCDC]' : 'bg-[#DEEAF5] text-[#003765] cursor-pointer'">
                                            <div>{{ data.attributes.title  }}</div>
                                            <div>{{ room.status ? 'เต็ม' : 'ว่าง' }}
                                            </div>
                                        </div>
                                    </div> -->
                                    <div v-for="data in otherOfBuilding">
                                        <div
                                            class="h-[32px] bg-[#165D98] rounded-[12px] flex items-center justify-between pl-[8px] pr-[8px] text-white">
                                            <div>{{ data.attributes.title }}</div>
                                            <div>
                                                <vs-checkbox color="#a3aab1" :val="data" v-model="items">
                                                </vs-checkbox>
                                            </div>
                                        </div>
                                    </div>
                                </div>
                            </div>
                        </div>
                    </div>
                    <div class="flex justify-end mt-[30px]">
                        <div>
                            <vs-button dark shadow @click="getFacilities()">
                                <div class="text-custom">ยกเลิก</div>
                            </vs-button>
                        </div>
                        <div>
                            <vs-button color="#003765" @click="createOrEdit()">
                                <div class="text-custom">บันทึก</div>
                            </vs-button>
                        </div>
                    </div>
                </div>
            </b-modal>
        </div>
    </div>
</template>
<script>
import axios from 'axios'
export default {
    data() {
        return {
            add_on: false,
            create: false,
            items: [],
            is_edit: false,
            facilities: {
                id: '',
                title: '',
                price: 0,
                discount: true,
                discountAmount: 0,
                note: '',
                remain: true,
                status: true
            },
            otherOfBuilding: []
        }
    },
    mounted() {
        this.getFacilities()
        this.getOtherBuilding()
    },
    created() {
        const loading = this.$vs.loading({})
        setTimeout(() => {
            loading.close()
        }, 1000)
    },
    methods: {
        getFacilities() {
            this.items = []
            const loading = this.$vs.loading()
            fetch('https://api.resguru.app/api' + '/rooms?filters[room_building][id][$eq]=' + this.$store.state.building + '&populate=*&filters[id][$eq]=' + this.$route.query.id_room)
                .then(response => response.json())
                .then((resp) => {
                    this.items = resp.data[0]?.attributes.other_of_buildings.data;
                }).finally(() => {
                    this.add_on = false
                    loading.close()
                })
        },
        getOtherBuilding() {
            const loading = this.$vs.loading()
            fetch('https://api.resguru.app/api' + '/other-of-buildings?filters[building][id][$eq]=' + this.$store.state.building)
                .then(response => response.json())
                .then((resp) => {
                    console.log("Return from getOther()", resp.data);
                    this.otherOfBuilding = resp.data
                }).finally(() => {
                    loading.close()
                })
        },
        createOrEdit() {
            const loading = this.$vs.loading()
            console.log(this.items);
            let ids = this.items.map(item => item.id);
            axios.put('https://api.resguru.app/api' + '/rooms/' + this.$route.query.id_room, {
                data: {
                    "other_of_buildings": [],
                }
            }).then(() => {
                axios.put('https://api.resguru.app/api' + '/rooms/' + this.$route.query.id_room, {
                    data: {
                        "other_of_buildings": ids,
                    }
                })

            }).finally(() => {
                this.add_on = false
                this.getFacilities()
                loading.close()
            })


        },
        getDetailFacilities(id) {
            const loading = this.$vs.loading()
            fetch('https://api.resguru.app/api' + '/other-of-buildings/' + id)
                .then(response => response.json())
                .then((resp) => {
                    console.log(resp);
                    this.facilities.id = resp.data.id,
                        this.facilities.title = resp.data.attributes.title,
                        this.facilities.price = resp.data.attributes.price,
                        this.facilities.note = resp.data.attributes.note,
                        this.facilities.status = resp.data.attributes.status,
                        this.facilities.remain = resp.data.attributes.remain,
                        this.facilities.discount = resp.data.attributes.discount,
                        this.facilities.discountAmount = resp.data.attributes.discountAmount
                }).finally(() => {
                    this.create = true,
                        loading.close()
                })
        },
        EditFacilities() {
            const loading = this.$vs.loading()
            axios.put('https://api.resguru.app/api' + '/other-of-buildings/' + this.facilities.id, {
                data: {
                    title: this.facilities.title,
                    price: this.facilities.price,
                    note: this.facilities.note,
                }
            })
                .finally(() => {
                    this.create = false,
                    this.getFacilities()
                    loading.close()
                })
        },
        delectFacilities(id) {
            const loading = this.$vs.loading()
            axios.delete('https://api.resguru.app/api' + '/other-of-buildings/' + id)
                .finally(() => {
                    this.create = false,
                        this.getFacilities()
                    loading.close()
                })
        }

    }
}

</script>