<template>
    <div class="h-[100%] bg-[white] rounded-[12px] pt-[28px] pl-[28px] pr-[28px] pb-[28px] mt-[14px]  mr-[24px] ml-[24px]"
        id="room-detail">
        <div class="">
            <div class="flex cursor-pointer">
                <div class="flex justify-center items-center mr-[8px]"><svg width="7" height="12" viewBox="0 0 7 12"
                        fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0.338101 5.99962C0.338101 5.88552 0.357334 5.77495 0.3958 5.6679C0.434267 5.56085 0.500293 5.46053 0.593876 5.36695L5.10348 0.857324C5.24834 0.712458 5.42142 0.642591 5.6227 0.647724C5.82398 0.652841 5.99706 0.727841 6.14193 0.872724C6.28679 1.01759 6.35923 1.19322 6.35923 1.39962C6.35923 1.60602 6.28679 1.78166 6.14193 1.92652L2.06883 5.99962L6.1573 10.0881C6.30217 10.233 6.37204 10.406 6.36693 10.6073C6.36179 10.8086 6.28679 10.9817 6.14193 11.1265C5.99706 11.2714 5.82142 11.3438 5.615 11.3438C5.4086 11.3438 5.23297 11.2714 5.0881 11.1265L0.593876 6.6323C0.500293 6.53872 0.434267 6.44 0.3958 6.33615C0.357334 6.23232 0.338101 6.12014 0.338101 5.99962Z"
                            fill="#8396A6" />
                    </svg></div>
                <div class="flex justify-center items-center text-[#8396A6]">ย้อนกลับ</div>
            </div>
        </div>
        <div class="flex mt-[14px]">
            <div class="text-[18px] font-bold text-[#141629] flex items-center justify-center">ห้อง 101</div>
            <div
                class="ml-[14px] h-[36px] w-[auto] text-[12px] flex items-center justify-center p-[8px] rounded-[12px]  bg-[#F0F8FF] text-[#165D98]">
                ทำสัญญาแล้ว</div>
        </div>
        <div class="flex justify-start items-center rounded-[12px] mt-[14px]">
            <div class="bg-[#F3F7FA] rounded-[12px]">
                <div class="flex justify-start items-center">
                    <div @click="tab = 1" class="cursor-pointer "
                        :class="tab == 1 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                        ผู้เช่า</div>
                    <div @click="tab = 2" class="cursor-pointer ml-[8px]"
                        :class="tab == 2 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                        สัญญาเช่า
                    </div>
                    <div @click="tab = 3" class="cursor-pointer  ml-[8px]"
                        :class="tab == 3 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                        สิ่งอำนวยความสะดวก
                    </div>
                    <div @click="tab = 4" class="cursor-pointer  ml-[8px]"
                        :class="tab == 4 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : ' text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                        ย้ายออก
                    </div>
                </div>
            </div>
        </div>
        <div>
            <div>
                <div class="grid grid-cols-7 w-[100%] gap-4 mt-[14px]" v-if="tab == 1">
                    <div class="h-[212px] border rounded-[12px] flex flex-col justify-between items-center p-[14px] ">
                        <div
                            class="h-[24px] w-[auto] mt-[-22px] text-[12px] flex items-center justify-center p-[8px] rounded-[8px]  bg-[#D7F1E3] text-[#39B974]">
                            ทำสัญญาแล้ว
                        </div>
                        <div class="w-[78px] h-[78px] rounded-[22px] bg-[#8396A6]"></div>
                        <div>ชัชพล บุญพันธุ์</div>
                        <div class="flex">
                            <div><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_417_4380" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                        width="16" height="16">
                                        <rect width="16" height="16" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_417_4380)">
                                        <path
                                            d="M12.9553 13.6283C11.6587 13.6283 10.3748 13.3206 9.10339 12.7052C7.83203 12.0899 6.697 11.2828 5.69829 10.2841C4.69957 9.28539 3.89145 8.15142 3.27394 6.8822C2.65642 5.61297 2.34766 4.33007 2.34766 3.0335C2.34766 2.8335 2.41432 2.66683 2.54766 2.5335C2.68099 2.40016 2.84766 2.3335 3.04766 2.3335H5.22197C5.39463 2.3335 5.54527 2.3867 5.67391 2.49311C5.80253 2.59952 5.88223 2.73692 5.91301 2.9053L6.29506 4.86681C6.32155 5.03091 6.31877 5.18006 6.28672 5.31425C6.25467 5.44844 6.18437 5.56553 6.07582 5.66553L4.54249 7.16425C5.06899 8.05827 5.69677 8.86596 6.42584 9.58733C7.1549 10.3087 7.98011 10.9378 8.90149 11.4745L10.3912 9.95913C10.4998 9.85059 10.6282 9.77345 10.7765 9.72773C10.9248 9.682 11.0767 9.67238 11.2322 9.69888L13.0835 10.0758C13.2519 10.1134 13.3893 10.1948 13.4957 10.32C13.6021 10.4452 13.6553 10.5942 13.6553 10.7668V12.9283C13.6553 13.1283 13.5886 13.295 13.4553 13.4283C13.322 13.5617 13.1553 13.6283 12.9553 13.6283ZM4.06302 6.21811L5.25277 5.07965C5.27414 5.06255 5.28803 5.03904 5.29444 5.00913C5.30085 4.97921 5.29978 4.95143 5.29122 4.9258L5.00149 3.43605C4.99293 3.40186 4.97797 3.37622 4.95661 3.35913C4.93524 3.34203 4.90746 3.33348 4.87327 3.33348H3.44764C3.422 3.33348 3.40062 3.34203 3.38352 3.35913C3.36643 3.37622 3.35789 3.39759 3.35789 3.42323C3.39207 3.87879 3.46664 4.34161 3.58161 4.8117C3.69656 5.28179 3.85703 5.75059 4.06302 6.21811ZM12.5656 12.6078C12.5912 12.6078 12.6126 12.5993 12.6297 12.5822C12.6468 12.5651 12.6553 12.5437 12.6553 12.5181V11.1155C12.6553 11.0813 12.6468 11.0536 12.6297 11.0322C12.6126 11.0108 12.5869 10.9959 12.5527 10.9873L11.1528 10.7027C11.1271 10.6942 11.1047 10.6931 11.0854 10.6995C11.0662 10.7059 11.0459 10.7198 11.0245 10.7412L9.83736 11.9412C10.2792 12.1472 10.7401 12.3046 11.2201 12.4136C11.7 12.5226 12.1485 12.5873 12.5656 12.6078Z"
                                            fill="#141629" />
                                    </g>
                                </svg>
                            </div>
                            <div class="flex justify-center items-center ml-[4px]">0862347196</div>
                        </div>
                        <div class="flex justify-around w-[100%]">
                            <div
                                class="bg-[#003765] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ย้ายห้อง</div>
                            <div
                                class="bg-[#D44769] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ลบผู้เช่า</div>
                        </div>
                    </div>
                    <div class="h-[212px] border rounded-[12px] flex flex-col justify-between items-center p-[14px] ">
                        <div
                            class="h-[24px] w-[auto] mt-[-22px] text-[12px] flex items-center justify-center p-[8px] rounded-[8px]  bg-[#D7F1E3] text-[#39B974]">
                            ทำสัญญาแล้ว
                        </div>
                        <div class="w-[78px] h-[78px] rounded-[22px] bg-[#8396A6]"></div>
                        <div>ชัชพล บุญพันธุ์</div>
                        <div class="flex">
                            <div><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_417_4380" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                        width="16" height="16">
                                        <rect width="16" height="16" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_417_4380)">
                                        <path
                                            d="M12.9553 13.6283C11.6587 13.6283 10.3748 13.3206 9.10339 12.7052C7.83203 12.0899 6.697 11.2828 5.69829 10.2841C4.69957 9.28539 3.89145 8.15142 3.27394 6.8822C2.65642 5.61297 2.34766 4.33007 2.34766 3.0335C2.34766 2.8335 2.41432 2.66683 2.54766 2.5335C2.68099 2.40016 2.84766 2.3335 3.04766 2.3335H5.22197C5.39463 2.3335 5.54527 2.3867 5.67391 2.49311C5.80253 2.59952 5.88223 2.73692 5.91301 2.9053L6.29506 4.86681C6.32155 5.03091 6.31877 5.18006 6.28672 5.31425C6.25467 5.44844 6.18437 5.56553 6.07582 5.66553L4.54249 7.16425C5.06899 8.05827 5.69677 8.86596 6.42584 9.58733C7.1549 10.3087 7.98011 10.9378 8.90149 11.4745L10.3912 9.95913C10.4998 9.85059 10.6282 9.77345 10.7765 9.72773C10.9248 9.682 11.0767 9.67238 11.2322 9.69888L13.0835 10.0758C13.2519 10.1134 13.3893 10.1948 13.4957 10.32C13.6021 10.4452 13.6553 10.5942 13.6553 10.7668V12.9283C13.6553 13.1283 13.5886 13.295 13.4553 13.4283C13.322 13.5617 13.1553 13.6283 12.9553 13.6283ZM4.06302 6.21811L5.25277 5.07965C5.27414 5.06255 5.28803 5.03904 5.29444 5.00913C5.30085 4.97921 5.29978 4.95143 5.29122 4.9258L5.00149 3.43605C4.99293 3.40186 4.97797 3.37622 4.95661 3.35913C4.93524 3.34203 4.90746 3.33348 4.87327 3.33348H3.44764C3.422 3.33348 3.40062 3.34203 3.38352 3.35913C3.36643 3.37622 3.35789 3.39759 3.35789 3.42323C3.39207 3.87879 3.46664 4.34161 3.58161 4.8117C3.69656 5.28179 3.85703 5.75059 4.06302 6.21811ZM12.5656 12.6078C12.5912 12.6078 12.6126 12.5993 12.6297 12.5822C12.6468 12.5651 12.6553 12.5437 12.6553 12.5181V11.1155C12.6553 11.0813 12.6468 11.0536 12.6297 11.0322C12.6126 11.0108 12.5869 10.9959 12.5527 10.9873L11.1528 10.7027C11.1271 10.6942 11.1047 10.6931 11.0854 10.6995C11.0662 10.7059 11.0459 10.7198 11.0245 10.7412L9.83736 11.9412C10.2792 12.1472 10.7401 12.3046 11.2201 12.4136C11.7 12.5226 12.1485 12.5873 12.5656 12.6078Z"
                                            fill="#141629" />
                                    </g>
                                </svg>
                            </div>
                            <div class="flex justify-center items-center ml-[4px]">0862347196</div>
                        </div>
                        <div class="flex justify-around w-[100%]">
                            <div
                                class="bg-[#003765] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ย้ายห้อง</div>
                            <div
                                class="bg-[#D44769] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ลบผู้เช่า</div>
                        </div>
                    </div>
                    <div class="h-[212px] border rounded-[12px] flex flex-col justify-between items-center p-[14px] ">
                        <div
                            class="h-[24px] w-[auto] mt-[-22px] text-[12px] flex items-center justify-center p-[8px] rounded-[8px]  bg-[#D7F1E3] text-[#39B974]">
                            ทำสัญญาแล้ว
                        </div>
                        <div class="w-[78px] h-[78px] rounded-[22px] bg-[#8396A6]"></div>
                        <div>ชัชพล บุญพันธุ์</div>
                        <div class="flex">
                            <div><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_417_4380" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                        width="16" height="16">
                                        <rect width="16" height="16" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_417_4380)">
                                        <path
                                            d="M12.9553 13.6283C11.6587 13.6283 10.3748 13.3206 9.10339 12.7052C7.83203 12.0899 6.697 11.2828 5.69829 10.2841C4.69957 9.28539 3.89145 8.15142 3.27394 6.8822C2.65642 5.61297 2.34766 4.33007 2.34766 3.0335C2.34766 2.8335 2.41432 2.66683 2.54766 2.5335C2.68099 2.40016 2.84766 2.3335 3.04766 2.3335H5.22197C5.39463 2.3335 5.54527 2.3867 5.67391 2.49311C5.80253 2.59952 5.88223 2.73692 5.91301 2.9053L6.29506 4.86681C6.32155 5.03091 6.31877 5.18006 6.28672 5.31425C6.25467 5.44844 6.18437 5.56553 6.07582 5.66553L4.54249 7.16425C5.06899 8.05827 5.69677 8.86596 6.42584 9.58733C7.1549 10.3087 7.98011 10.9378 8.90149 11.4745L10.3912 9.95913C10.4998 9.85059 10.6282 9.77345 10.7765 9.72773C10.9248 9.682 11.0767 9.67238 11.2322 9.69888L13.0835 10.0758C13.2519 10.1134 13.3893 10.1948 13.4957 10.32C13.6021 10.4452 13.6553 10.5942 13.6553 10.7668V12.9283C13.6553 13.1283 13.5886 13.295 13.4553 13.4283C13.322 13.5617 13.1553 13.6283 12.9553 13.6283ZM4.06302 6.21811L5.25277 5.07965C5.27414 5.06255 5.28803 5.03904 5.29444 5.00913C5.30085 4.97921 5.29978 4.95143 5.29122 4.9258L5.00149 3.43605C4.99293 3.40186 4.97797 3.37622 4.95661 3.35913C4.93524 3.34203 4.90746 3.33348 4.87327 3.33348H3.44764C3.422 3.33348 3.40062 3.34203 3.38352 3.35913C3.36643 3.37622 3.35789 3.39759 3.35789 3.42323C3.39207 3.87879 3.46664 4.34161 3.58161 4.8117C3.69656 5.28179 3.85703 5.75059 4.06302 6.21811ZM12.5656 12.6078C12.5912 12.6078 12.6126 12.5993 12.6297 12.5822C12.6468 12.5651 12.6553 12.5437 12.6553 12.5181V11.1155C12.6553 11.0813 12.6468 11.0536 12.6297 11.0322C12.6126 11.0108 12.5869 10.9959 12.5527 10.9873L11.1528 10.7027C11.1271 10.6942 11.1047 10.6931 11.0854 10.6995C11.0662 10.7059 11.0459 10.7198 11.0245 10.7412L9.83736 11.9412C10.2792 12.1472 10.7401 12.3046 11.2201 12.4136C11.7 12.5226 12.1485 12.5873 12.5656 12.6078Z"
                                            fill="#141629" />
                                    </g>
                                </svg>
                            </div>
                            <div class="flex justify-center items-center ml-[4px]">0862347196</div>
                        </div>
                        <div class="flex justify-around w-[100%]">
                            <div
                                class="bg-[#003765] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ย้ายห้อง</div>
                            <div
                                class="bg-[#D44769] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ลบผู้เช่า</div>
                        </div>
                    </div>
                    <div class="h-[212px] border rounded-[12px] flex flex-col justify-between items-center p-[14px] ">
                        <div
                            class="h-[24px] w-[auto] mt-[-22px] text-[12px] flex items-center justify-center p-[8px] rounded-[8px]  bg-[#D7F1E3] text-[#39B974]">
                            ทำสัญญาแล้ว
                        </div>
                        <div class="w-[78px] h-[78px] rounded-[22px] bg-[#8396A6]"></div>
                        <div>ชัชพล บุญพันธุ์</div>
                        <div class="flex">
                            <div><svg width="16" height="16" viewBox="0 0 16 16" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_417_4380" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                        width="16" height="16">
                                        <rect width="16" height="16" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_417_4380)">
                                        <path
                                            d="M12.9553 13.6283C11.6587 13.6283 10.3748 13.3206 9.10339 12.7052C7.83203 12.0899 6.697 11.2828 5.69829 10.2841C4.69957 9.28539 3.89145 8.15142 3.27394 6.8822C2.65642 5.61297 2.34766 4.33007 2.34766 3.0335C2.34766 2.8335 2.41432 2.66683 2.54766 2.5335C2.68099 2.40016 2.84766 2.3335 3.04766 2.3335H5.22197C5.39463 2.3335 5.54527 2.3867 5.67391 2.49311C5.80253 2.59952 5.88223 2.73692 5.91301 2.9053L6.29506 4.86681C6.32155 5.03091 6.31877 5.18006 6.28672 5.31425C6.25467 5.44844 6.18437 5.56553 6.07582 5.66553L4.54249 7.16425C5.06899 8.05827 5.69677 8.86596 6.42584 9.58733C7.1549 10.3087 7.98011 10.9378 8.90149 11.4745L10.3912 9.95913C10.4998 9.85059 10.6282 9.77345 10.7765 9.72773C10.9248 9.682 11.0767 9.67238 11.2322 9.69888L13.0835 10.0758C13.2519 10.1134 13.3893 10.1948 13.4957 10.32C13.6021 10.4452 13.6553 10.5942 13.6553 10.7668V12.9283C13.6553 13.1283 13.5886 13.295 13.4553 13.4283C13.322 13.5617 13.1553 13.6283 12.9553 13.6283ZM4.06302 6.21811L5.25277 5.07965C5.27414 5.06255 5.28803 5.03904 5.29444 5.00913C5.30085 4.97921 5.29978 4.95143 5.29122 4.9258L5.00149 3.43605C4.99293 3.40186 4.97797 3.37622 4.95661 3.35913C4.93524 3.34203 4.90746 3.33348 4.87327 3.33348H3.44764C3.422 3.33348 3.40062 3.34203 3.38352 3.35913C3.36643 3.37622 3.35789 3.39759 3.35789 3.42323C3.39207 3.87879 3.46664 4.34161 3.58161 4.8117C3.69656 5.28179 3.85703 5.75059 4.06302 6.21811ZM12.5656 12.6078C12.5912 12.6078 12.6126 12.5993 12.6297 12.5822C12.6468 12.5651 12.6553 12.5437 12.6553 12.5181V11.1155C12.6553 11.0813 12.6468 11.0536 12.6297 11.0322C12.6126 11.0108 12.5869 10.9959 12.5527 10.9873L11.1528 10.7027C11.1271 10.6942 11.1047 10.6931 11.0854 10.6995C11.0662 10.7059 11.0459 10.7198 11.0245 10.7412L9.83736 11.9412C10.2792 12.1472 10.7401 12.3046 11.2201 12.4136C11.7 12.5226 12.1485 12.5873 12.5656 12.6078Z"
                                            fill="#141629" />
                                    </g>
                                </svg>
                            </div>
                            <div class="flex justify-center items-center ml-[4px]">0862347196</div>
                        </div>
                        <div class="flex justify-around w-[100%]">
                            <div
                                class="bg-[#003765] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ย้ายห้อง</div>
                            <div
                                class="bg-[#D44769] text-[white] pl-[8px] pr-[8px] pt-[1px] pb-[1px] flex justify-center items-center text-[12px] rounded-[8px]">
                                ลบผู้เช่า</div>
                        </div>
                    </div>
                    <div
                        class="h-[212px] border rounded-[12px] flex flex-col justify-center items-center p-[14px] cursor-pointer">
                        <div class="flex flex-col">
                            <div>
                                <svg width="76" height="76" viewBox="0 0 76 76" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <circle cx="38" cy="38" r="38" fill="#F3F7FA" />
                                    <mask id="mask0_2514_22683" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="7"
                                        y="7" width="62" height="62">
                                        <rect x="7.60156" y="7.6001" width="60.8" height="60.8" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_2514_22683)">
                                        <path
                                            d="M38.0015 55.1003C37.4629 55.1003 37.0117 54.9182 36.648 54.5541C36.2842 54.1899 36.1023 53.7387 36.1023 53.2003V39.9003H22.8023C22.2639 39.9003 21.8127 39.7181 21.4486 39.3538C21.0844 38.9895 20.9023 38.538 20.9023 37.9995C20.9023 37.4609 21.0844 37.0098 21.4486 36.646C21.8127 36.2823 22.2639 36.1004 22.8023 36.1004H36.1023V22.8003C36.1023 22.262 36.2845 21.8107 36.6488 21.4466C37.0131 21.0825 37.4646 20.9004 38.0031 20.9004C38.5417 20.9004 38.9929 21.0825 39.3566 21.4466C39.7203 21.8107 39.9022 22.262 39.9022 22.8003V36.1004H53.2023C53.7406 36.1004 54.1919 36.2825 54.556 36.6468C54.9202 37.0112 55.1022 37.4626 55.1022 38.0012C55.1022 38.5397 54.9202 38.9909 54.556 39.3546C54.1919 39.7184 53.7406 39.9003 53.2023 39.9003H39.9022V53.2003C39.9022 53.7387 39.7201 54.1899 39.3558 54.5541C38.9914 54.9182 38.54 55.1003 38.0015 55.1003Z"
                                            fill="#B9CCDC" />
                                    </g>
                                </svg>
                            </div>
                            <div class="flex justify-center mt-[4px]">เพิ่มผู้เช่า</div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data() {
        return {
            tab: 1
        }
    },
    created() {
        const loading = this.$vs.loading({
            opacity: 1,
        })
        setTimeout(() => {
            loading.close()
        }, 1000)
    },
}
</script>
<style></style>