<template>
    <div class="h-[100%]  rounded-[12px] pl-[20px] pr-[20px] pt-[10px] mt-[14px]" id="room-detail">
        <div class="">
            <div class="flex cursor-pointer">
                <div class="flex justify-center items-center mr-[8px]"><svg width="7" height="12" viewBox="0 0 7 12"
                        fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M0.338101 5.99962C0.338101 5.88552 0.357334 5.77495 0.3958 5.6679C0.434267 5.56085 0.500293 5.46053 0.593876 5.36695L5.10348 0.857324C5.24834 0.712458 5.42142 0.642591 5.6227 0.647724C5.82398 0.652841 5.99706 0.727841 6.14193 0.872724C6.28679 1.01759 6.35923 1.19322 6.35923 1.39962C6.35923 1.60602 6.28679 1.78166 6.14193 1.92652L2.06883 5.99962L6.1573 10.0881C6.30217 10.233 6.37204 10.406 6.36693 10.6073C6.36179 10.8086 6.28679 10.9817 6.14193 11.1265C5.99706 11.2714 5.82142 11.3438 5.615 11.3438C5.4086 11.3438 5.23297 11.2714 5.0881 11.1265L0.593876 6.6323C0.500293 6.53872 0.434267 6.44 0.3958 6.33615C0.357334 6.23232 0.338101 6.12014 0.338101 5.99962Z"
                            fill="#8396A6" />
                    </svg></div>
                <div class="flex justify-center items-center text-[#8396A6] cursor-pointer" @click="routeTo('/payment')">
                    ย้อนกลับ</div>
            </div>
        </div>
        <div class="flex mt-[14px]">
            <div class="bg-[#003765] h-[147px] w-[404px] rounded-[22px] p-[14px] text-[white]">
                <div class="flex items-center">
                    <div v-if="userProfileImage">
                        <img class="w-[114px] h-[114px] bg-slate-400 rounded-[22px]"
                                :src="userProfileImage" />
                    </div>
                    <div v-else>
                        <div class="w-[114px] h-[114px] bg-slate-400 rounded-[22px]"></div>
                    </div>
                    <div class="ml-[8px] flex flex-col justify-between h-[100%]">
                        <div class="flex items-center">
                            <div>
                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_1318_18103" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                        y="0" width="30" height="30">
                                        <rect width="30" height="30" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_1318_18103)">
                                        <path
                                            d="M3.125 25.6245V11.5621L12.5 4.50684L18.3533 8.92024C17.9767 8.99074 17.6233 9.09651 17.2932 9.23755C16.9631 9.37858 16.6458 9.55886 16.3413 9.7784L12.5 6.85052L4.99997 12.4996V23.7496H10.0721V25.6245H3.125ZM12.8125 25.6245V23.6074C12.8125 23.2358 12.9099 22.8894 13.1046 22.5681C13.2993 22.2467 13.5561 21.9875 13.875 21.7904C14.8093 21.2359 15.7904 20.8189 16.8185 20.5392C17.8465 20.2596 18.907 20.1197 20 20.1197C21.0929 20.1197 22.1534 20.2596 23.1814 20.5392C24.2095 20.8189 25.1907 21.2359 26.125 21.7904C26.4439 21.9875 26.7007 22.2467 26.8954 22.5681C27.0901 22.8894 27.1874 23.2358 27.1874 23.6074V25.6245H12.8125ZM14.8028 23.7496H25.1971V23.413C24.4038 22.9563 23.5709 22.6057 22.6983 22.3613C21.8257 22.1169 20.9263 21.9947 20 21.9947C19.0737 21.9947 18.1742 22.1169 17.3016 22.3613C16.429 22.6057 15.5961 22.9563 14.8028 23.413V23.7496ZM20.0014 18.1846C19.0469 18.1846 18.2352 17.8506 17.5661 17.1824C16.897 16.5143 16.5625 15.703 16.5625 14.7486C16.5625 13.7941 16.8966 12.9823 17.5647 12.3132C18.2328 11.6442 19.0441 11.3096 19.9986 11.3096C20.953 11.3096 21.7648 11.6437 22.4338 12.3118C23.1029 12.98 23.4374 13.7913 23.4374 14.7457C23.4374 15.7002 23.1034 16.5119 22.4353 17.181C21.7671 17.8501 20.9558 18.1846 20.0014 18.1846ZM20 16.3096C20.4343 16.3096 20.8033 16.1578 21.107 15.8541C21.4107 15.5504 21.5625 15.1814 21.5625 14.7471C21.5625 14.3128 21.4107 13.9438 21.107 13.6401C20.8033 13.3365 20.4343 13.1846 20 13.1846C19.5657 13.1846 19.1967 13.3365 18.893 13.6401C18.5893 13.9438 18.4374 14.3128 18.4374 14.7471C18.4374 15.1814 18.5893 15.5504 18.893 15.8541C19.1967 16.1578 19.5657 16.3096 20 16.3096Z"
                                            fill="white" />
                                    </g>
                                    
                                </svg>
                                
                                
                                
                            </div>
                            <div class="ml-[4px]">{{ userProfile.attributes.RoomNumber }}</div>
                        </div>
                        <div class="text-[16px] mt-[4px]">{{ userProfile.attributes.users_permissions_user.data.attributes.firstName }} {{ userProfile.attributes.users_permissions_user.data.attributes.lastName }}</div>
                        <div class="text-[12px] text-[#B9CCDC] mt-[4px]">เข้าพักเมื่อวันที่: {{ userProfile.attributes.checkInDate }}</div>
                        <div class="text-[12px] text-[#B9CCDC]">ประเภทห้อง: ห้องพร้อมเฟอร์นิเจอร์</div>
                    </div>
                </div>
            </div>
            <div class="bg-[#D44769] h-[147px] w-[339px] rounded-[22px] p-[14px] text-[white] ml-[14px]">
                <div class="flex flex-col justify-between h-[100%]">
                    <div class="font-bold text-[16px]">ยอดค้างชำระ</div>
                    <div>
                        <div class="text-[12px]">คงเหลือ</div>
                        <div class="flex justify-between">
                            <div class="text-[18px] font-bold flex items-center">6,500</div>
                            <!-- <div class="flex pt-[4px] pb-[4px] pl-[12px] pr-[12px] border rounded-[12px]  ">
                                <div>
                                    <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <mask id="mask0_3440_6436" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                            y="0" width="22" height="23">
                                            <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                        </mask>
                                        <g mask="url(#mask0_3440_6436)">
                                            <path
                                                d="M11.0104 19.2913C9.92874 19.2913 8.9156 19.0868 7.97096 18.6778C7.02632 18.2688 6.20261 17.713 5.49983 17.0102C4.79705 16.3074 4.24118 15.4838 3.83221 14.5393C3.42324 13.5947 3.21875 12.5817 3.21875 11.5002C3.21875 10.4186 3.42324 9.40543 3.83221 8.46056C4.24118 7.51569 4.79705 6.69187 5.49983 5.98909C6.20261 5.28633 7.02632 4.73046 7.97096 4.32149C8.9156 3.9125 9.92874 3.70801 11.0104 3.70801C12.1633 3.70801 13.2586 3.9504 14.2963 4.43518C15.334 4.91996 16.2248 5.60128 16.9687 6.47916V4.99485C16.9687 4.80006 17.0346 4.63677 17.1664 4.505C17.2983 4.37323 17.4616 4.30735 17.6565 4.30735C17.8513 4.30735 18.0146 4.37323 18.1462 4.505C18.2779 4.63677 18.3437 4.80006 18.3437 4.99485V8.13262C18.3437 8.36736 18.2643 8.56413 18.1055 8.72293C17.9466 8.88174 17.7499 8.96115 17.5151 8.96115H14.3774C14.1826 8.96115 14.0193 8.89523 13.8875 8.7634C13.7557 8.63157 13.6899 8.46822 13.6899 8.27335C13.6899 8.07847 13.7557 7.91522 13.8875 7.7836C14.0193 7.65198 14.1826 7.58617 14.3774 7.58617H16.0873C15.455 6.80701 14.7011 6.19502 13.8256 5.7502C12.9501 5.30539 12.0117 5.08299 11.0104 5.08299C9.22289 5.08299 7.70657 5.70555 6.46144 6.95069C5.2163 8.19583 4.59373 9.71215 4.59373 11.4997C4.59373 13.2872 5.2163 14.8035 6.46144 16.0486C7.70657 17.2937 9.22289 17.9163 11.0104 17.9163C12.4912 17.9163 13.8089 17.4618 14.9635 16.5528C16.1182 15.6438 16.87 14.4812 17.219 13.065C17.2778 12.8735 17.3815 12.7283 17.5302 12.6296C17.6788 12.5309 17.8469 12.4939 18.0344 12.5186C18.2335 12.5432 18.3875 12.632 18.4962 12.7847C18.6049 12.9375 18.6345 13.105 18.5852 13.2871C18.1892 15.0405 17.2884 16.4796 15.8828 17.6043C14.4773 18.729 12.8531 19.2913 11.0104 19.2913ZM11.6979 11.2211L14.2187 13.742C14.3456 13.8689 14.4106 14.0284 14.4135 14.2206C14.4164 14.4127 14.3515 14.5752 14.2187 14.708C14.0859 14.8408 13.9249 14.9072 13.7357 14.9072C13.5465 14.9072 13.3855 14.8408 13.2527 14.708L10.5714 12.0267C10.4857 11.9409 10.4228 11.8475 10.3828 11.7463C10.3429 11.6451 10.3229 11.5406 10.3229 11.4327V7.6038C10.3229 7.40902 10.3888 7.24575 10.5206 7.11398C10.6525 6.9822 10.8158 6.91632 11.0107 6.91632C11.2056 6.91632 11.3688 6.9822 11.5004 7.11398C11.6321 7.24575 11.6979 7.40902 11.6979 7.6038V11.2211Z"
                                                fill="white" />
                                        </g>
                                    </svg>
                                </div>
                                <div class="flex items-center ml-[4px]">ดูประวัติการใช้จ่าย</div>
                            </div> -->
                        </div>
                    </div>

                </div>
            </div>

        </div>
        <div class="mt-[14px] bg-[white] rounded-[12px] p-[24px]">
            <div class="font-bold text-[18px]">ประวัติการจ่ายค่าเช่า</div>
            <div class="flex justify-start items-center rounded-[12px] mt-[14px]">
                <div class="bg-[#F3F7FA] rounded-[12px]">
                    <div class="flex justify-start items-center">
                        <div @click="tab = 1" class="cursor-pointer "
                            :class="tab == 1 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                            <div class="flex">
                                <div>
                                    <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <mask id="mask0_3440_9673" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                            y="0" width="22" height="23">
                                            <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                        </mask>
                                        <g mask="url(#mask0_3440_9673)">
                                            <path
                                                d="M17.4594 16.6629V18.2601C17.4594 18.3705 17.4994 18.4657 17.5793 18.5456C17.6592 18.6255 17.7544 18.6655 17.8649 18.6655C17.9753 18.6655 18.0705 18.6255 18.1504 18.5456C18.2303 18.4657 18.2703 18.3705 18.2703 18.2601V15.6952C18.2703 15.5847 18.2289 15.488 18.146 15.4052C18.0632 15.3223 17.9665 15.2809 17.8561 15.2809H15.2912C15.1807 15.2809 15.0855 15.3209 15.0056 15.4008C14.9257 15.4807 14.8857 15.5759 14.8857 15.6864C14.8857 15.7968 14.9257 15.892 15.0056 15.9719C15.0855 16.0518 15.1807 16.0918 15.2912 16.0918H16.8883L14.7306 18.2495C14.6507 18.3294 14.6092 18.4231 14.6063 18.5306C14.6034 18.6382 14.6448 18.7348 14.7306 18.8206C14.8105 18.9005 14.9057 18.9405 15.0162 18.9405C15.1266 18.9405 15.2218 18.9005 15.3017 18.8206L17.4594 16.6629ZM4.86409 19.2913C4.40693 19.2913 4.01647 19.1294 3.6927 18.8056C3.36892 18.4819 3.20703 18.0914 3.20703 17.6342V5.36507C3.20703 4.90791 3.36892 4.51745 3.6927 4.19368C4.01647 3.8699 4.40693 3.70801 4.86409 3.70801H17.1333C17.5904 3.70801 17.9809 3.8699 18.3046 4.19368C18.6284 4.51745 18.7903 4.90791 18.7903 5.36507V11.1629C18.5647 11.0666 18.3387 10.9849 18.1125 10.9179C17.8863 10.8509 17.6539 10.7975 17.4153 10.7575V5.36507C17.4153 5.29454 17.386 5.2299 17.3272 5.17112C17.2684 5.11236 17.2038 5.08298 17.1333 5.08298H4.86409C4.79357 5.08298 4.72892 5.11236 4.67015 5.17112C4.61139 5.2299 4.58201 5.29454 4.58201 5.36507V17.6342C4.58201 17.7048 4.61139 17.7694 4.67015 17.8282C4.72892 17.8869 4.79357 17.9163 4.86409 17.9163H10.2336C10.2677 18.1702 10.3182 18.4102 10.3852 18.6364C10.4522 18.8626 10.5339 19.0809 10.6302 19.2913H4.86409ZM4.58201 17.9163V5.08298V10.7575V10.6888V17.9163ZM6.64453 15.0605C6.64453 15.2556 6.71034 15.419 6.84196 15.5506C6.97358 15.6822 7.13693 15.748 7.33201 15.748H10.3271C10.367 15.5095 10.4264 15.2771 10.5051 15.0508C10.5838 14.8246 10.6696 14.5987 10.7625 14.3731H7.33201C7.13693 14.3731 6.97358 14.4389 6.84196 14.5705C6.71034 14.7021 6.64453 14.8655 6.64453 15.0605ZM6.64453 11.4997C6.64453 11.6947 6.71034 11.8581 6.84196 11.9897C6.97358 12.1213 7.13693 12.1871 7.33201 12.1871H12.4566C12.8514 11.8522 13.2727 11.5716 13.7205 11.3454C14.1682 11.1192 14.6477 10.9585 15.1589 10.8633C15.0567 10.8386 14.9421 10.8239 14.8151 10.8192C14.6882 10.8145 14.5737 10.8122 14.4714 10.8122H7.33201C7.13693 10.8122 6.97358 10.878 6.84196 11.0096C6.71034 11.1412 6.64453 11.3046 6.64453 11.4997ZM6.64453 7.93877C6.64453 8.13385 6.71034 8.2972 6.84196 8.42882C6.97358 8.56044 7.13693 8.62625 7.33201 8.62625H14.6653C14.8604 8.62625 15.0238 8.56044 15.1554 8.42882C15.287 8.2972 15.3528 8.13385 15.3528 7.93877C15.3528 7.74369 15.287 7.58034 15.1554 7.44872C15.0238 7.31708 14.8604 7.25127 14.6653 7.25127H7.33201C7.13693 7.25127 6.97358 7.31708 6.84196 7.44872C6.71034 7.58034 6.64453 7.74369 6.64453 7.93877ZM16.4987 21.1775C15.354 21.1775 14.3804 20.7762 13.5777 19.9735C12.775 19.1708 12.3737 18.1972 12.3737 17.0525C12.3737 15.9079 12.775 14.9342 13.5777 14.1316C14.3804 13.3289 15.354 12.9276 16.4987 12.9276C17.6433 12.9276 18.617 13.3289 19.4197 14.1316C20.2223 14.9342 20.6237 15.9079 20.6237 17.0525C20.6237 18.1972 20.2223 19.1708 19.4197 19.9735C18.617 20.7762 17.6433 21.1775 16.4987 21.1775Z"
                                                :fill="tab == 1 ? 'white' : '#003765'" />
                                        </g>
                                    </svg>
                                </div>
                                <div class="ml-[4px] flex items-center">ใบแจ้งหนี้</div>
                            </div>
                        </div>
                        <div @click="tab = 3" class="cursor-pointer "
                            :class="tab == 3 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                            <div class="flex">
                                <div>
                                    <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <mask id="mask0_3440_6436" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                            y="0" width="22" height="23">
                                            <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                        </mask>
                                        <g mask="url(#mask0_3440_6436)">
                                            <path
                                                d="M11.0104 19.2913C9.92874 19.2913 8.9156 19.0868 7.97096 18.6778C7.02632 18.2688 6.20261 17.713 5.49983 17.0102C4.79705 16.3074 4.24118 15.4838 3.83221 14.5393C3.42324 13.5947 3.21875 12.5817 3.21875 11.5002C3.21875 10.4186 3.42324 9.40543 3.83221 8.46056C4.24118 7.51569 4.79705 6.69187 5.49983 5.98909C6.20261 5.28633 7.02632 4.73046 7.97096 4.32149C8.9156 3.9125 9.92874 3.70801 11.0104 3.70801C12.1633 3.70801 13.2586 3.9504 14.2963 4.43518C15.334 4.91996 16.2248 5.60128 16.9687 6.47916V4.99485C16.9687 4.80006 17.0346 4.63677 17.1664 4.505C17.2983 4.37323 17.4616 4.30735 17.6565 4.30735C17.8513 4.30735 18.0146 4.37323 18.1462 4.505C18.2779 4.63677 18.3437 4.80006 18.3437 4.99485V8.13262C18.3437 8.36736 18.2643 8.56413 18.1055 8.72293C17.9466 8.88174 17.7499 8.96115 17.5151 8.96115H14.3774C14.1826 8.96115 14.0193 8.89523 13.8875 8.7634C13.7557 8.63157 13.6899 8.46822 13.6899 8.27335C13.6899 8.07847 13.7557 7.91522 13.8875 7.7836C14.0193 7.65198 14.1826 7.58617 14.3774 7.58617H16.0873C15.455 6.80701 14.7011 6.19502 13.8256 5.7502C12.9501 5.30539 12.0117 5.08299 11.0104 5.08299C9.22289 5.08299 7.70657 5.70555 6.46144 6.95069C5.2163 8.19583 4.59373 9.71215 4.59373 11.4997C4.59373 13.2872 5.2163 14.8035 6.46144 16.0486C7.70657 17.2937 9.22289 17.9163 11.0104 17.9163C12.4912 17.9163 13.8089 17.4618 14.9635 16.5528C16.1182 15.6438 16.87 14.4812 17.219 13.065C17.2778 12.8735 17.3815 12.7283 17.5302 12.6296C17.6788 12.5309 17.8469 12.4939 18.0344 12.5186C18.2335 12.5432 18.3875 12.632 18.4962 12.7847C18.6049 12.9375 18.6345 13.105 18.5852 13.2871C18.1892 15.0405 17.2884 16.4796 15.8828 17.6043C14.4773 18.729 12.8531 19.2913 11.0104 19.2913ZM11.6979 11.2211L14.2187 13.742C14.3456 13.8689 14.4106 14.0284 14.4135 14.2206C14.4164 14.4127 14.3515 14.5752 14.2187 14.708C14.0859 14.8408 13.9249 14.9072 13.7357 14.9072C13.5465 14.9072 13.3855 14.8408 13.2527 14.708L10.5714 12.0267C10.4857 11.9409 10.4228 11.8475 10.3828 11.7463C10.3429 11.6451 10.3229 11.5406 10.3229 11.4327V7.6038C10.3229 7.40902 10.3888 7.24575 10.5206 7.11398C10.6525 6.9822 10.8158 6.91632 11.0107 6.91632C11.2056 6.91632 11.3688 6.9822 11.5004 7.11398C11.6321 7.24575 11.6979 7.40902 11.6979 7.6038V11.2211Z"
                                                :fill="tab == 3 ? 'white' : '#003765'" />
                                        </g>
                                    </svg>
                                </div>
                                <div class="ml-[4px] flex items-center">หลักฐานการชำระและประวัติการจ่าย</div>
                            </div>
                        </div>
                        <div @click="tab = 2" class="cursor-pointer "
                            :class="tab == 2 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                            <div class="flex">
                                <div>
                                    <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <mask id="mask0_3440_16537" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                            y="0" width="22" height="23">
                                            <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                        </mask>
                                        <g mask="url(#mask0_3440_16537)">
                                            <path
                                                d="M5.49867 20.2087C4.8582 20.2087 4.31614 19.9869 3.87249 19.5433C3.42885 19.0996 3.20703 18.5575 3.20703 17.9171V16.454C3.20703 16.2192 3.28644 16.0224 3.44525 15.8636C3.60405 15.7048 3.80082 15.6254 4.03556 15.6254H5.95703V3.61535C5.95703 3.4661 6.02255 3.36885 6.15359 3.3236C6.28462 3.27836 6.41125 3.31686 6.53348 3.43908L7.22627 4.13185L8.21806 3.15565C8.3043 3.07076 8.40319 3.02832 8.51471 3.02832C8.62626 3.02832 8.72385 3.07122 8.8075 3.15702L9.79997 4.13185L10.7918 3.15565C10.878 3.07076 10.9769 3.02832 11.0884 3.02832C11.2 3.02832 11.2976 3.07122 11.3812 3.15702L12.3737 4.13185L13.3655 3.15565C13.4517 3.07076 13.5506 3.02832 13.6621 3.02832C13.7737 3.02832 13.8713 3.07122 13.9549 3.15702L14.9474 4.13185L15.9392 3.15565C16.0254 3.07076 16.1243 3.02832 16.2358 3.02832C16.3474 3.02832 16.445 3.07122 16.5286 3.15702L17.5211 4.13185L18.2139 3.43908C18.3361 3.31686 18.4627 3.27601 18.5938 3.31654C18.7248 3.35709 18.7903 3.45669 18.7903 3.61535V17.9171C18.7903 18.5575 18.5685 19.0996 18.1249 19.5433C17.6812 19.9869 17.1392 20.2087 16.4987 20.2087H5.49867ZM16.4987 18.8337C16.7584 18.8337 16.9761 18.7459 17.1518 18.5702C17.3275 18.3945 17.4153 18.1768 17.4153 17.9171V5.08374H7.33201V15.6254H14.7535C14.9882 15.6254 15.185 15.7048 15.3438 15.8636C15.5026 16.0224 15.582 16.2192 15.582 16.454V17.9171C15.582 18.1768 15.6699 18.3945 15.8455 18.5702C16.0212 18.7459 16.239 18.8337 16.4987 18.8337ZM9.08953 8.52122C8.90033 8.52122 8.74227 8.45531 8.61534 8.32349C8.48843 8.19166 8.42497 8.02831 8.42497 7.83344C8.42497 7.63856 8.49086 7.47531 8.62263 7.34369C8.75438 7.21207 8.91766 7.14626 9.11245 7.14626H12.9378C13.1326 7.14626 13.2958 7.21217 13.4276 7.34399C13.5594 7.47582 13.6253 7.63917 13.6253 7.83404C13.6253 8.02892 13.5594 8.19217 13.4276 8.32379C13.2958 8.45541 13.1326 8.52122 12.9378 8.52122H9.08953ZM9.08953 11.2712C8.90033 11.2712 8.74227 11.2053 8.61534 11.0735C8.48843 10.9417 8.42497 10.7783 8.42497 10.5834C8.42497 10.3886 8.49086 10.2253 8.62263 10.0937C8.75438 9.96207 8.91766 9.89626 9.11245 9.89626H12.9378C13.1326 9.89626 13.2958 9.96217 13.4276 10.094C13.5594 10.2258 13.6253 10.3892 13.6253 10.584C13.6253 10.7789 13.5594 10.9422 13.4276 11.0738C13.2958 11.2054 13.1326 11.2712 12.9378 11.2712H9.08953ZM15.5291 8.64462C15.3047 8.64462 15.1134 8.56559 14.9553 8.40753C14.7973 8.24946 14.7182 8.0582 14.7182 7.83374C14.7182 7.60928 14.7973 7.41802 14.9553 7.25995C15.1134 7.10189 15.3047 7.02286 15.5291 7.02286C15.7536 7.02286 15.9448 7.10189 16.1029 7.25995C16.261 7.41802 16.34 7.60928 16.34 7.83374C16.34 8.0582 16.261 8.24946 16.1029 8.40753C15.9448 8.56559 15.7536 8.64462 15.5291 8.64462ZM15.5291 11.3946C15.3047 11.3946 15.1134 11.3156 14.9553 11.1575C14.7973 10.9995 14.7182 10.8082 14.7182 10.5837C14.7182 10.3593 14.7973 10.168 14.9553 10.01C15.1134 9.85189 15.3047 9.77286 15.5291 9.77286C15.7536 9.77286 15.9448 9.85189 16.1029 10.01C16.261 10.168 16.34 10.3593 16.34 10.5837C16.34 10.8082 16.261 10.9995 16.1029 11.1575C15.9448 11.3156 15.7536 11.3946 15.5291 11.3946ZM5.49867 18.8337H14.207V17.0004H4.58201V17.9171C4.58201 18.1768 4.66986 18.3945 4.84555 18.5702C5.02124 18.7459 5.23895 18.8337 5.49867 18.8337Z"
                                                :fill="tab == 2 ? 'white' : '#003765'" />
                                        </g>
                                    </svg>
                                </div>
                                <div class="ml-[4px] flex items-center">ใบเสร็จรับเงิน</div>
                            </div>
                        </div>
                       
                    </div>
                </div>
            </div>
            <div class="w-[100%] h-[1px]  mt-[24px] mb-[24px] bg-gray-200 border-0 dark:bg-gray-700"></div>
            <div v-if="selected.length > 0"  @click="PDFPrint()" class="h-[36px] flex rounded-[12px] mt-[12px] cursor-pointer">
                <div class="flex justify-center items-center">
                    <svg width="22" height="23" viewBox="0 0 22 23" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <mask id="mask0_3430_22284" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                            width="22" height="23">
                            <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                        </mask>
                        <g mask="url(#mask0_3430_22284)">
                            <path
                                d="M11 14.469C10.8895 14.469 10.7867 14.4514 10.6915 14.4161C10.5963 14.3809 10.5058 14.3203 10.42 14.2345L7.56956 11.3841C7.44265 11.2572 7.37772 11.0976 7.37479 10.9055C7.37184 10.7134 7.43676 10.5509 7.56956 10.4181C7.70235 10.2853 7.8657 10.2166 8.05961 10.2118C8.25351 10.2071 8.41687 10.2712 8.54968 10.404L10.3125 12.1668V5.15427C10.3125 4.95919 10.3783 4.79584 10.5099 4.66422C10.6415 4.53261 10.8049 4.4668 11 4.4668C11.1951 4.4668 11.3584 4.53261 11.49 4.66422C11.6216 4.79584 11.6875 4.95919 11.6875 5.15427V12.1668L13.4503 10.404C13.5772 10.2771 13.7391 10.2145 13.9359 10.2162C14.1328 10.218 14.2976 10.2853 14.4304 10.4181C14.5632 10.5509 14.6296 10.7119 14.6296 10.9011C14.6296 11.0903 14.5632 11.2513 14.4304 11.3841L11.5799 14.2345C11.4941 14.3203 11.4037 14.3809 11.3085 14.4161C11.2133 14.4514 11.1105 14.469 11 14.469ZM5.78206 18.3754C5.31902 18.3754 4.92708 18.215 4.60625 17.8942C4.28542 17.5733 4.125 17.1814 4.125 16.7183V14.9379C4.125 14.7428 4.19082 14.5795 4.32245 14.4479C4.45407 14.3162 4.61742 14.2504 4.8125 14.2504C5.00758 14.2504 5.17093 14.3162 5.30255 14.4479C5.43417 14.5795 5.49998 14.7428 5.49998 14.9379V16.7183C5.49998 16.7889 5.52936 16.8535 5.58811 16.9123C5.64689 16.971 5.71154 17.0004 5.78206 17.0004H16.2179C16.2884 17.0004 16.3531 16.971 16.4118 16.9123C16.4706 16.8535 16.5 16.7889 16.5 16.7183V14.9379C16.5 14.7428 16.5658 14.5795 16.6974 14.4479C16.829 14.3162 16.9924 14.2504 17.1875 14.2504C17.3825 14.2504 17.5459 14.3162 17.6775 14.4479C17.8091 14.5795 17.875 14.7428 17.875 14.9379V16.7183C17.875 17.1814 17.7145 17.5733 17.3937 17.8942C17.0729 18.215 16.6809 18.3754 16.2179 18.3754H5.78206Z"
                                fill="#003765" />
                        </g>
                    </svg>
                </div>
                <div class=" font-bold ml-[8px] flex justify-center items-center">ดาวน์โหลดใบแจ้งหนี้</div>
            </div>
            <div class="mt-[20px]" v-if="tab == 1">
                <vs-table v-model="selected">
                    <template #thead>
                        <vs-tr>
                            <vs-th>
                                <vs-checkbox :indeterminate="selected.length == users.length" v-model="allCheck"
                                    @change="selected = $vs.checkAll(selected, users)" />
                            </vs-th>
                            <vs-th>
                                หมายเลขใบแจ้งหนี้ 
                            </vs-th>
                            <vs-th>
                                ค่าห้องเช่า
                            </vs-th>
                            <vs-th>
                                ค่าน้ำ
                            </vs-th>
                            <vs-th>
                                ค่าไฟฟ้า
                            </vs-th>
                            <vs-th>
                                ค่าส่วนกลาง
                            </vs-th>
                            <vs-th>
                                ค่าบริการอื่น ๆ
                            </vs-th>
                            <vs-th>
                                ยอดรวม
                            </vs-th>
                            <vs-th>
                                ชำระแล้ว
                            </vs-th>
                            <vs-th>
                                วันที่สร้างเอกสาร
                            </vs-th>
                            <vs-th>
                                สถานะ
                            </vs-th>
                            <vs-th>
                                Event/Action
                            </vs-th>
                            <vs-th>

                            </vs-th>
                        </vs-tr>
                    </template>
                    <template #tbody>
                        <vs-tr :key="i" v-for="(tr, i) in userInvoice" :data="tr" :is-selected="!!selected.includes(tr)">
                            <vs-td checkbox>
                                <vs-checkbox :val="tr" v-model="selected" />
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.invoiceNumber }}
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.paymentStatus==='Paid' || tr.attributes.paymentStatus==='Partial Paid'|| tr.attributes.paymentStatus==='Waiting Review'  ">
                                    <vs-input disabled  v-model="tr.attributes.roomPrice" @change="updateRoomPriceInvoice(tr.id,tr.attributes.roomPrice)"/> 
                                </div>
                                <div v-else>
                                    <vs-input v-model="tr.attributes.roomPrice" @change="updateRoomPriceInvoice(tr.id,tr.attributes.roomPrice)"/> 
                                </div>
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.paymentStatus==='Paid' || tr.attributes.paymentStatus==='Partial Paid'|| tr.attributes.paymentStatus==='Waiting Review'  ">
                                    <vs-input disabled  v-model="tr.attributes.waterPrice" @change="updateWaterPriceInvoice(tr.id,tr.attributes.waterPrice)"/>  
                                </div>
                                <div v-else>
                                    <vs-input  v-model="tr.attributes.waterPrice" @change="updateWaterPriceInvoice(tr.id,tr.attributes.waterPrice)"/>  
                                </div>
                                
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.paymentStatus==='Paid' || tr.attributes.paymentStatus==='Partial Paid'|| tr.attributes.paymentStatus==='Waiting Review'  ">
                                    
                                     <vs-input disabled  v-model="tr.attributes.electricPrice" @change="updateElecPriceInvoice(tr.id,tr.attributes.electricPrice)"/>  
                                </div>
                                <div v-else>

                                    <vs-input  v-model="tr.attributes.electricPrice" @change="updateElecPriceInvoice(tr.id,tr.attributes.electricPrice)"/>  
                                </div>
                                
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.paymentStatus==='Paid' || tr.attributes.paymentStatus==='Partial Paid' || tr.attributes.paymentStatus==='Waiting Review' ">
                                    
                                    <vs-input disabled v-model="tr.attributes.communalPrice" @change="updateCommunualPriceInvoice(tr.id,tr.attributes.communalPrice)"/>  
                               </div>
                               <div v-else>

                                     <vs-input  v-model="tr.attributes.communalPrice" @change="updateCommunualPriceInvoice(tr.id,tr.attributes.communalPrice)"/>  
                               </div>
                               
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.paymentStatus==='Paid' || tr.attributes.paymentStatus==='Partial Paid' || tr.attributes.paymentStatus==='Waiting Review' ">
                                    
                                     <vs-input disabled  v-model="tr.attributes.otherPrice" @change="updateOtherInvoice(tr.id,tr.attributes.otherPrice)"/> 
                               </div>
                               <div v-else>

                                    <vs-input  v-model="tr.attributes.otherPrice" @change="updateOtherInvoice(tr.id,tr.attributes.otherPrice)"/> 
                               </div> 
                            </vs-td>
                            <vs-td>
                                <!-- <vs-input  v-model="tr.attributes.total"/>   -->
                                {{ $formatNumber(tr.attributes.total) }}
                            </vs-td>
                            <vs-td>
                                <vs-input  v-model="tr.attributes.paid"/> 
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.createdAt }}
                            </vs-td>
                            <vs-td>
                                <div class="flex items-center justify-start">
                                    <div class="h-[36px] w-[auto] flex items-center justify-center pl-[12px] pr-[12px] rounded-[12px] pb-[4px] pt-[4px]"
                                        :class="tr.status == 1 ? 'bg-[#CFFBDA] text-[#0B9A3C]' : tr.status == 'ยังไม่ชำระ' ? 'bg-[#FFE1E8] text-[#EA2F5C]' : ' bg-[#FFF2BC] text-[#D48C00] '">
                                        {{ tr.attributes.paymentStatus }}
                                    </div>
                                </div>
                            </vs-td>
                            <vs-td>
                                <vs-select v-if="tr.attributes.paymentStatus==='Paid' || tr.attributes.paymentStatus==='Partial Paid' || tr.attributes.paymentStatus==='Waiting Review'" 
                                placeholder="เมนู" v-model="tr.attributes.lastEvent" @change="selectMenu(tr.attributes.lastEvent,tr)">
                                            <vs-option label="เลือกเมนู" value="Select Menu">
                                            เลือกเมนู
                                            </vs-option>
                                            <vs-option label="อัพเดท" value="Update">
                                            อัพเดท
                                            </vs-option>
                                </vs-select>
                                <!-- <vs-button @click="createReceipt(tr)">สร้างใบเสร็จ</vs-button> -->
                                <vs-select v-else placeholder="เมนู" v-model="tr.attributes.lastEvent" @change="selectMenu(tr.attributes.lastEvent,tr)">
                                            <vs-option label="เลือกเมนู" value="Select Menu">
                                            เลือกเมนู
                                            </vs-option>
                                            <vs-option label="อัพเดท" value="Update">
                                            อัพเดท
                                            </vs-option>
                                            <vs-option label="ชำระเงิน" value="Full Payment">
                                            ชำระเงิน
                                            </vs-option>
                                            <vs-option label="ชำระบางส่วน" value="Partial Payment">
                                            ชำระบางส่วน
                                            </vs-option>
                                </vs-select>
                            </vs-td>
                            <vs-td>
                                
                                <svg @click="PDFPrint()" width="24" height="24" viewBox="0 0 24 24" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_2691_23279" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                        y="0" width="24" height="24">
                                        <rect width="24" height="24" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_2691_23279)">
                                        <path
                                            d="M12 15.2386C11.8795 15.2386 11.7673 15.2194 11.6634 15.1809C11.5596 15.1425 11.4609 15.0765 11.3673 14.9829L8.2577 11.8733C8.11925 11.7348 8.04842 11.5608 8.04522 11.3512C8.04201 11.1416 8.11283 10.9643 8.2577 10.8195C8.40257 10.6746 8.58077 10.5996 8.7923 10.5945C9.00383 10.5893 9.18204 10.6592 9.32692 10.8041L11.25 12.7272V5.07712C11.25 4.86431 11.3218 4.68611 11.4654 4.54252C11.609 4.39894 11.7872 4.32715 12 4.32715C12.2128 4.32715 12.391 4.39894 12.5346 4.54252C12.6782 4.68611 12.7499 4.86431 12.7499 5.07712V12.7272L14.673 10.8041C14.8115 10.6656 14.9881 10.5974 15.2028 10.5993C15.4176 10.6012 15.5974 10.6746 15.7422 10.8195C15.8871 10.9643 15.9595 11.14 15.9595 11.3464C15.9595 11.5528 15.8871 11.7284 15.7422 11.8733L12.6327 14.9829C12.5391 15.0765 12.4403 15.1425 12.3365 15.1809C12.2327 15.2194 12.1205 15.2386 12 15.2386ZM6.3077 19.5002C5.80257 19.5002 5.375 19.3252 5.025 18.9752C4.675 18.6252 4.5 18.1976 4.5 17.6925V15.7502C4.5 15.5374 4.5718 15.3592 4.7154 15.2156C4.85898 15.072 5.03718 15.0002 5.25 15.0002C5.46282 15.0002 5.64102 15.072 5.7846 15.2156C5.92818 15.3592 5.99997 15.5374 5.99997 15.7502V17.6925C5.99997 17.7694 6.03202 17.8399 6.09612 17.904C6.16024 17.9681 6.23077 18.0002 6.3077 18.0002H17.6922C17.7692 18.0002 17.8397 17.9681 17.9038 17.904C17.9679 17.8399 18 17.7694 18 17.6925V15.7502C18 15.5374 18.0718 15.3592 18.2154 15.2156C18.3589 15.072 18.5371 15.0002 18.75 15.0002C18.9628 15.0002 19.141 15.072 19.2845 15.2156C19.4281 15.3592 19.5 15.5374 19.5 15.7502V17.6925C19.5 18.1976 19.325 18.6252 18.975 18.9752C18.625 19.3252 18.1974 19.5002 17.6922 19.5002H6.3077Z"
                                            fill="#8396A6" />
                                    </g>
                                </svg>
                            </vs-td>
                        </vs-tr>
                    </template>
                </vs-table>
            </div>
            <div class="mt-[14px]" v-if="tab == 2">
                <vs-table v-model="selected">
                    <template #thead>
                        <vs-tr>
                            <vs-th>
                                <vs-checkbox :indeterminate="selected.length == users.length" v-model="allCheck"
                                    @change="selected = $vs.checkAll(selected, users)" />
                            </vs-th>
                            <vs-th>
                                หมายเลขใบเสร็จรับเงิน
                            </vs-th>
                            <vs-th>
                                ค่าห้องเช่า
                            </vs-th>
                            <vs-th>
                                ค่าน้ำ
                            </vs-th>
                            <vs-th>
                                ค่าไฟฟ้า
                            </vs-th>
                            <vs-th>
                                ค่าส่วนกลาง
                            </vs-th>
                            <vs-th>
                                ค่าบริการอื่น ๆ
                            </vs-th>
                            <vs-th>
                                ยอดรวม
                            </vs-th>
                            <vs-th>
                                ชำระแล้ว
                            </vs-th>
                            <vs-th>
                                วันที่ออกใบเสร็จ
                            </vs-th>
                            <vs-th>

                            </vs-th>
                        </vs-tr>
                    </template>
                    <template #tbody>
                        <vs-tr :key="i" v-for="(tr, i) in userReceipt" :data="tr" :is-selected="!!selected.includes(tr)">
                            <vs-td checkbox>
                                <vs-checkbox :val="tr" v-model="selected" />
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.receiptNumber }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.roomPrice) }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.waterPrice) }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.electricPrice) }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.communalPrice) }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.otherPrice) }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.paidAmount) }}
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.total) }}
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.createdAt }} 
                            </vs-td>
                            <vs-td>
                                <svg @click="PDFPrintReceipt(tr)" width="24" height="24" viewBox="0 0 24 24" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_2691_23279" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                        y="0" width="24" height="24">
                                        <rect width="24" height="24" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_2691_23279)">
                                        <path
                                            d="M12 15.2386C11.8795 15.2386 11.7673 15.2194 11.6634 15.1809C11.5596 15.1425 11.4609 15.0765 11.3673 14.9829L8.2577 11.8733C8.11925 11.7348 8.04842 11.5608 8.04522 11.3512C8.04201 11.1416 8.11283 10.9643 8.2577 10.8195C8.40257 10.6746 8.58077 10.5996 8.7923 10.5945C9.00383 10.5893 9.18204 10.6592 9.32692 10.8041L11.25 12.7272V5.07712C11.25 4.86431 11.3218 4.68611 11.4654 4.54252C11.609 4.39894 11.7872 4.32715 12 4.32715C12.2128 4.32715 12.391 4.39894 12.5346 4.54252C12.6782 4.68611 12.7499 4.86431 12.7499 5.07712V12.7272L14.673 10.8041C14.8115 10.6656 14.9881 10.5974 15.2028 10.5993C15.4176 10.6012 15.5974 10.6746 15.7422 10.8195C15.8871 10.9643 15.9595 11.14 15.9595 11.3464C15.9595 11.5528 15.8871 11.7284 15.7422 11.8733L12.6327 14.9829C12.5391 15.0765 12.4403 15.1425 12.3365 15.1809C12.2327 15.2194 12.1205 15.2386 12 15.2386ZM6.3077 19.5002C5.80257 19.5002 5.375 19.3252 5.025 18.9752C4.675 18.6252 4.5 18.1976 4.5 17.6925V15.7502C4.5 15.5374 4.5718 15.3592 4.7154 15.2156C4.85898 15.072 5.03718 15.0002 5.25 15.0002C5.46282 15.0002 5.64102 15.072 5.7846 15.2156C5.92818 15.3592 5.99997 15.5374 5.99997 15.7502V17.6925C5.99997 17.7694 6.03202 17.8399 6.09612 17.904C6.16024 17.9681 6.23077 18.0002 6.3077 18.0002H17.6922C17.7692 18.0002 17.8397 17.9681 17.9038 17.904C17.9679 17.8399 18 17.7694 18 17.6925V15.7502C18 15.5374 18.0718 15.3592 18.2154 15.2156C18.3589 15.072 18.5371 15.0002 18.75 15.0002C18.9628 15.0002 19.141 15.072 19.2845 15.2156C19.4281 15.3592 19.5 15.5374 19.5 15.7502V17.6925C19.5 18.1976 19.325 18.6252 18.975 18.9752C18.625 19.3252 18.1974 19.5002 17.6922 19.5002H6.3077Z"
                                            fill="#8396A6" />
                                    </g>
                                </svg>
                            </vs-td>
                        </vs-tr>
                    </template>
                </vs-table>
            </div>
            <div class="mt-[14px]" v-if="tab == 3">
                <vs-table>
                    <template #thead>
                        <vs-tr>
                            <vs-th>
                                วันเวลาที่โอน
                            </vs-th>
                            <vs-th>
                                Ref: Invoice Number
                            </vs-th>
                            <vs-th>
                                ธนาคาร
                            </vs-th>
                            <vs-th>
                                Image
                            </vs-th>
                            <vs-th>
                                จำนวนเงิน
                            </vs-th>
                            <vs-th>
                                Status
                            </vs-th>
                            <vs-th>
                                Receipt
                            </vs-th>
                            <vs-th>
                                Event Action
                            </vs-th>
                        </vs-tr>
                    </template>
                    <template #tbody>
                        <vs-tr :key="i" v-for="(tr, i) in userEvidencePayment" :data="tr">
                            <vs-td>
                                {{ tr.attributes.createdAt }}
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.tenant_bill.data.attributes.invoiceNumber }}
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.bankName }}
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.evidence.data">
                                    <a :href="'https://api.resguru.app' + tr.attributes.evidence.data.attributes.url" target="_blank"> {{ tr.attributes.evidence.data.attributes.name }}</a>
                                </div> 
                                <div v-else>
                                    <div> No evidence uploaded</div>
                                </div>                 
                            </vs-td>
                            <vs-td>
                                {{ $formatNumber(tr.attributes.amount) }}
                            </vs-td>
                            <vs-td>
                                {{ tr.attributes.evidenceStatus }}
                            </vs-td>
                            <vs-td>
                                <div v-if="tr.attributes.tenant_receipt.data">
                                    {{ tr.attributes.tenant_receipt.data.attributes.receiptNumber }}
                                </div>
                            </vs-td>
                            <vs-td>
                                <div v-if="!tr.attributes.tenant_receipt.data">
                                    <vs-button @click="createReceipt(tr)" small>สร้างใบเสร็จ</vs-button>
                                </div>
                                <div>
                                    <vs-button @click="updateInvoice(tr)" small>ทดสอบ</vs-button>
                                </div>
                            </vs-td>
                        </vs-tr>
                    </template>
                </vs-table>
            </div> <div><PDFgenerator ref="childComponentPDFReceipt"/></div>
        </div>
        
        <b-modal centered v-model="createFullpayment" size="l" hide-backdrop hide-header-close hide-header hide-footer
                    class="p-[-20px] text-custom">
                    <div>
                        <div class="flex justify-between">
                            <div class="text-custom flex justify-center items-center text-[16px] font-bold">
                                แนบหลักฐานการชำระแบบเต็มจำนวน</div>
                            <div @click="createFullpayment = false" class="cursor-pointer">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_417_4814" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                        width="24" height="24">
                                        <rect width="24" height="24" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_417_4814)">
                                        <path
                                            d="M12.0005 13.0538L6.92737 18.1269C6.78892 18.2654 6.61489 18.3362 6.40527 18.3394C6.19567 18.3426 6.01844 18.2718 5.87357 18.1269C5.72869 17.982 5.65625 17.8064 5.65625 17.6C5.65625 17.3936 5.72869 17.218 5.87357 17.0731L10.9466 12L5.87357 6.92689C5.73511 6.78844 5.66427 6.6144 5.66107 6.40479C5.65786 6.19519 5.72869 6.01795 5.87357 5.87309C6.01844 5.7282 6.19407 5.65576 6.40047 5.65576C6.60687 5.65576 6.78251 5.7282 6.92737 5.87309L12.0005 10.9462L17.0736 5.87309C17.212 5.73462 17.3861 5.66379 17.5957 5.66059C17.8053 5.65737 17.9825 5.7282 18.1274 5.87309C18.2723 6.01795 18.3447 6.19359 18.3447 6.39999C18.3447 6.60639 18.2723 6.78202 18.1274 6.92689L13.0543 12L18.1274 17.0731C18.2658 17.2115 18.3367 17.3856 18.3399 17.5952C18.3431 17.8048 18.2723 17.982 18.1274 18.1269C17.9825 18.2718 17.8069 18.3442 17.6005 18.3442C17.3941 18.3442 17.2184 18.2718 17.0736 18.1269L12.0005 13.0538Z"
                                            fill="#5C6B79" />
                                    </g>
                                </svg>
                            </div>
                        </div>
                        <div class="w-[100%] h-[1px]  mt-[24px] mb-[14px] bg-gray-200 border-0 dark:bg-gray-700"></div>
                        <div class="text-custom">เลขที่ใบแจ้งหนี้ (Invoice)</div>
                        <div>
                            <input disabled
                                class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]"
                                v-model="fullPaymentForm.invoiceName" />
                            <input
                                class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]"
                                v-model="fullPaymentForm.invoiceID" hidden />
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">ชื่อธนาคาร</div>
                            <div>
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="fullPaymentForm.bankName" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">ชื่อผู้โอน</div>
                            <div>
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="fullPaymentForm.accountBankName" />
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]"
                                    v-model="fullPaymentForm.userID" hidden />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">ยอดโอน (เต็มจำนวน)</div>
                            <div>
                                <input disabled
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="fullPaymentForm.amount" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">วันที่</div>
                            <div>
                                <input type="date"
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="fullPaymentForm.paymentDate" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">เวลา</div>
                            <div>
                                <input type="time"
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="fullPaymentForm.paymentTime" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">แนบหลักฐานการโอน</div>
                            <div class="mt-[4px] flex">
                            <input class="h-[28px] w-[120px] rounded-[12px] border flex justify-start" id="upload"
                                ref="FullPayment" hidden @change="setUploadFileFullPayment()" type="file" />
                            <label for="upload">
                                <div
                                    class="h-[28px] w-[120px] flex justify-center text-custom items-center bg-[#165D98] text-[14px] text-[white] rounded-[12px] cursor-pointer">
                                    อัพโหลดรูปภาพ</div>
                            </label>
                            <div v-if="this.fileFullPayment.name" class="text-[#5C6B79] text-custom flex justify-center items-center ml-[8px] text-[12px]">
                                {{this.fileFullPayment.name}}</div>
                            <div v-else class="text-[#5C6B79] text-custom flex justify-center items-center ml-[8px] text-[12px]">
                                ยังไม่ได้เลือกไฟล์</div>
                        </div>
                        </div>
                        <div class="flex justify-end mt-[30px]">
                            <div>
                                <vs-button dark shadow @click="createFullpayment = false">
                                    <div class="text-custom">ยกเลิก</div>
                                </vs-button>
                            </div>
                            <div>
                                <vs-button @click="createFullPayment()" color="#003765">
                                    <div class="text-custom">บันทึก</div>
                                </vs-button>
                            </div>
                        </div>
                    </div>
                </b-modal>

                <b-modal centered v-model="createPartialPayment" size="l" hide-backdrop hide-header-close hide-header hide-footer
                    class="p-[-20px] text-custom">
                    <div>
                        <div class="flex justify-between">
                            <div class="text-custom flex justify-center items-center text-[16px] font-bold">
                                แนบหลักฐานการชำระบางส่วน</div>
                            <div @click="createPartialPayment = false" class="cursor-pointer">
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_417_4814" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                        width="24" height="24">
                                        <rect width="24" height="24" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_417_4814)">
                                        <path
                                            d="M12.0005 13.0538L6.92737 18.1269C6.78892 18.2654 6.61489 18.3362 6.40527 18.3394C6.19567 18.3426 6.01844 18.2718 5.87357 18.1269C5.72869 17.982 5.65625 17.8064 5.65625 17.6C5.65625 17.3936 5.72869 17.218 5.87357 17.0731L10.9466 12L5.87357 6.92689C5.73511 6.78844 5.66427 6.6144 5.66107 6.40479C5.65786 6.19519 5.72869 6.01795 5.87357 5.87309C6.01844 5.7282 6.19407 5.65576 6.40047 5.65576C6.60687 5.65576 6.78251 5.7282 6.92737 5.87309L12.0005 10.9462L17.0736 5.87309C17.212 5.73462 17.3861 5.66379 17.5957 5.66059C17.8053 5.65737 17.9825 5.7282 18.1274 5.87309C18.2723 6.01795 18.3447 6.19359 18.3447 6.39999C18.3447 6.60639 18.2723 6.78202 18.1274 6.92689L13.0543 12L18.1274 17.0731C18.2658 17.2115 18.3367 17.3856 18.3399 17.5952C18.3431 17.8048 18.2723 17.982 18.1274 18.1269C17.9825 18.2718 17.8069 18.3442 17.6005 18.3442C17.3941 18.3442 17.2184 18.2718 17.0736 18.1269L12.0005 13.0538Z"
                                            fill="#5C6B79" />
                                    </g>
                                </svg>
                            </div>
                        </div>
                        <div class="w-[100%] h-[1px]  mt-[24px] mb-[14px] bg-gray-200 border-0 dark:bg-gray-700"></div>
                        <div class="mt-[14px]">
                            <div class="text-custom">ชื่อธนาคาร</div>
                            <div>
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="partialPaymentForm.bankName" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">ชื่อผู้โอน</div>
                            <div>
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="partialPaymentForm.accountBankName" />
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]"
                                    v-model="partialPaymentForm.userID" hidden />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">ยอดโอน</div>
                            <div>
                                <input
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="partialPaymentForm.amount" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">วันที่</div>
                            <div>
                                <input type="date"
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="partialPaymentForm.paymentDate" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">เวลา</div>
                            <div>
                                <input type="time"
                                    class="w-[100%] h-[36px]  rounded-[12px] pl-[8px] pr-[8px] text-custom bg-[#F3F7FA] mt-[8px]" 
                                    v-model="partialPaymentForm.paymentTime" />
                            </div>
                        </div>
                        <div class="mt-[14px]">
                            <div class="text-custom">แนบหลักฐานการโอน</div>
                            <div class="mt-[4px] flex">
                                <input class="h-[28px] w-[120px] rounded-[12px] border flex justify-start" id="upload" hidden
                                    type="file" />
                                <label for="upload">
                                    <div
                                        class="h-[28px] w-[120px] flex justify-center text-custom items-center bg-[#165D98] text-[14px] text-[white] rounded-[12px] cursor-pointer">
                                        อัพโหลดรูปภาพ</div>
                                </label>
                                <div class="text-[#5C6B79] text-custom flex justify-center items-center ml-[8px] text-[12px]">
                                    ยังไม่ได้เลือกไฟล์</div>
                            </div>
                        </div>
                        <div class="flex justify-end mt-[30px]">
                            <div>
                                <vs-button dark shadow @click="createPartialPayment = false">
                                    <div class="text-custom">ยกเลิก</div>
                                </vs-button>
                            </div>
                            <div>
                                <vs-button @click="createPartial()" color="#003765">
                                    <div class="text-custom">บันทึก</div>
                                </vs-button>
                            </div>
                        </div>
                    </div>
                </b-modal>
    </div>
</template>
<script>

import axios from 'axios'
import { degrees, PDFDocument, rgb, StandardFonts } from 'pdf-lib';
import download from 'downloadjs';
import PDFgenerator from '@/views/payment/components/PDFgeneratorReceipt'

export default {
    components:{PDFgenerator},
    data() {
        return {
            popup_filter: false,
            menu_option: 0,
            createFullpayment: false,
            createPartialPayment: false,
            tab: 1,
            allCheck: false,
            selected: [],
            users: [
                {
                    "id": 1,
                    "name": "ใบแจ้งหนี้#190523",
                    "type": "ห้องพร้อมเฟอร์นิเจอร์",
                    "price": "3,500",
                    "price2": "3,500",
                    "price3": "3,500",
                    "price4": "3,500",
                    "price5": "3,500",
                    "price6": "3,500",
                    "status": "ยังไม่ชำระ",
                },
                {
                    "id": 2,
                    "name": "ใบแจ้งหนี้#190523",
                    "type": "ห้องพร้อมเฟอร์นิเจอร์",
                    "price": "3,500",
                    "price2": "3,500",
                    "price3": "3,500",
                    "price4": "3,500",
                    "price5": "3,500",
                    "price6": "3,500",
                    "status": "ยังไม่ชำระ",
                },
                {
                    "id": 3,
                    "name": "ใบแจ้งหนี้#190523",
                    "type": "ห้องพร้อมเฟอร์นิเจอร์",
                    "price": "3,500",
                    "price2": "3,500",
                    "price3": "3,500",
                    "price4": "3,500",
                    "price5": "3,500",
                    "price6": "3,500",
                    "status": "ยังไม่ชำระ",
                },
            ],
            users2: [
                {
                    "id": '28/03/2023 : 10.00 น.',
                    "name": "Kbank",
                    "username": "4,500",
                },

            ],
            userProfile: [],
            userInvoice: [],
            userReceipt: [],
            userProfileImage: [],
            userEvidencePayment: [],
            PartialPayment: [],
            fileFullPayment: [],
            fullPaymentForm: {
                invoiceID: '',
                invoiceName: '',
                roomName: '',
                userID: '',
                bankName: '',
                accountBankName: '',
                amount: 0,
                paymentDate: '01/01/2023',
                paymentTime: '',
                building: ''
            },
            partialPaymentForm: {
                invoiceID: '',
                invoiceName: '',
                roomName: '',
                userID: '',
                bankName: '',
                accountBankName: '',
                amount: 0,
                paymentDate: '01/01/2023',
                paymentTime: '',
                building: ''
            },
        }
    },
    created() {
        const loading = this.$vs.loading({})
        setTimeout(() => {
            loading.close()
        }, 1000)
    },
    mounted() {
       console.log("URL Param: ",this.$route.query.profileId)
       this.getUserProfile();
       this.getInvoice();
       this.getReceipt();
       this.getEvidence();
    },
    methods: {
        routeTo(path) {
            this.$router.push({
                path: path,
            })
        },
        updateRoomPriceInvoice(invoiceid,value){
            axios.put('https://api.resguru.app/api/tenant-bills/' + invoiceid, {
                data: {
                    roomPrice: value,
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Room Price Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
        },
        updateWaterPriceInvoice(invoiceid,value){
            axios.put('https://api.resguru.app/api/tenant-bills/' + invoiceid, {
                data: {
                    waterPrice: value,
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Water Price Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
        },
        updateElecPriceInvoice(invoiceid,value){
            axios.put('https://api.resguru.app/api/tenant-bills/' + invoiceid, {
                data: {
                    electricPrice: value,
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Electric Price Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
        },
        updateCommunualPriceInvoice(invoiceid,value){
            axios.put('https://api.resguru.app/api/tenant-bills/' + invoiceid, {
                data: {
                    communalPrice: value,
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Communal Price Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
        },
        updateOtherInvoice(invoiceid,value){
            axios.put('https://api.resguru.app/api/tenant-bills/' + invoiceid, {
                data: {
                    otherPrice: value,
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Other Price Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
        },
        getUserProfile() {
            const loading = this.$vs.loading()
            fetch(`https://api.resguru.app/api/user-sign-contracts/${this.$route.query.profileId}?populate=*`)
                .then(response => response.json())
                .then((resp) => {
                    console.log("Return from getUser()",resp.data);
                    this.userProfile = resp.data
                    fetch(`https://api.resguru.app/api/users/${resp.data.attributes.users_permissions_user.data.id}?populate=imageProfile`)
                    .then(response => response.json())
                    .then((res) =>{
                        console.log("Return from getImage()",res);
                        this.userProfileImage = res.filePath
                    })
                    
                })
                
                .finally(() => {
                    loading.close()
                })
        },
        selectMenu(menu_option,tr){
            console.log("?????", tr)
            console.log('why userSign',tr.attributes.user_sign_contract.data.id)
            console.log('why bill',tr.id)
            console.log('why building',tr.attributes.building.data.id)
            if(menu_option == "Full Payment") {
                this.createFullpayment = true
                this.fullPaymentForm.amount = tr.attributes.total
                // this.fullPaymentForm.invoiceName = tr.attributes.invoiceNumber
                this.fullPaymentForm.invoiceName = generateReNumber()
                this.fullPaymentForm.building = tr.attributes.building.data.id
                this.fullPaymentForm.userID = tr.attributes.user_sign_contract.data.id
                this.fullPaymentForm.invoiceID = tr.id
            }
            else if(menu_option == "Partial Payment"){
                this.createPartialPayment = true   
            }
        },
        createFullPayment(){
            axios.post("https://api.resguru.app/api/tenant-evidence-payments", {
                data: {
                    tenant_bill: this.fullPaymentForm.invoiceID,
                    user_sign_contract: this.fullPaymentForm.userID,
                    bankName: this.fullPaymentForm.accountBankName,
                    accountBankName: this.fullPaymentForm.bankName,
                    amount: this.fullPaymentForm.amount,
                    // paymentDate: this.fullPaymentForm.paymentDate,
                    // paymentTime: this.fullPaymentForm.paymentTime,
                    building:  this.fullPaymentForm.building 
                }
            }).then(
                    (resp) => {
                        console.log("Response in create", resp)
                        console.log("Response Evidence ID", resp.data.data.id)
                        axios.put("https://api.resguru.app/api/tenant-bills/" + this.fullPaymentForm.invoiceID, {
                            data: {
                                paymentStatus: "Waiting Review"
                            }
                        }).then((res) => { console.log("Response in Edit Invoice", res) })

                        if (this.fileFullPayment.length != 0) {
                            let formData = new FormData();
                            formData.append("files", this.fileFullPayment);
                            formData.append("refId", String(resp.data.data.id));
                            formData.append("ref", "api::tenant-evidence-payment.tenant-evidence-payment");
                            formData.append("field", "evidence");

                            axios.post("https://api.resguru.app/api/upload", formData, {
                                headers: {
                                    "Content-Type": "multipart/form-data",
                                },
                            }).then((result) => { console.log("Upload file", result) })
                                .catch((error) => {
                                    console.log(error);
                                })
                        }
                       
                    }
                )
                .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
                })
                .finally(()=>{
                    this.$showNotification('#3A89CB', 'Update Service Success')
                 })
            this.createFullpayment = false
            // alert("Full payment is created")
           
        },
        createPartial(){
            axios.post("https://api.resguru.app/api/tenant-evidence-payments", {
                data: {
                    tenant_bill: this.partialPaymentForm.invoiceID,
                    user_sign_contract: this.partialPaymentForm.userID,
                    bankName: this.partialPaymentForm.accountBankName,
                    accountBankName: this.partialPaymentForm.bankName,
                    amount: this.partialPaymentForm.amount,
                    // paymentDate: this.partialPaymentForm.paymentDate,
                    // paymentTime: this.partialPaymentForm.paymentTime,
                    building:  this.partialPaymentForm.building 
                }
            }).then(
                    (resp) => {
                        console.log("Response in create", resp)
                        console.log("Response Evidence ID", resp.data.data.id)
                        axios.put("https://api.resguru.app/api/tenant-bills/" + this.partialPaymentForm.invoiceID, {
                            data: {
                                paymentStatus: "Waiting Review"
                            }
                        }).then((res) => { console.log("Response in Edit Invoice", res) })

                        if (this.file.length != 0) {
                            let formData = new FormData();
                            formData.append("files", this.file);
                            formData.append("refId", String(resp.data.data.id));
                            formData.append("ref", "api::tenant-evidence-payment.tenant-evidence-payment");
                            formData.append("field", "evidence");

                            axios.post("https://api.resguru.app/api/upload", formData, {
                                headers: {
                                    "Content-Type": "multipart/form-data",
                                },
                            }).then((result) => { console.log("Upload file", result) })
                                .catch((error) => {
                                    console.log(error);
                                })
                        }
                        this.$showNotification('#3A89CB', 'Update Service Success')
                    }
                )
                .catch(error => {
                    const errorMessage = error.message ? error.message : 'Error updating information';
                    this.$showNotification('danger', errorMessage); 
                    })
            this.createPartialPayment = false
            // alert("Partial payment is created")
       
        },
        getInvoice(){
            const loading = this.$vs.loading()
            fetch(`https://api.resguru.app/api/tenant-bills?filters[user_sign_contract][id][$eq]=${this.$route.query.profileId}&populate=*&sort[0]=id:desc`)
                .then(response => response.json())
                .then((resp) => {
                    console.log("Return from getInvoice()",resp.data);
                    this.userInvoice = resp.data
                }).finally(() => {
                    loading.close()
                })
        },
        getReceipt(){
            const loading = this.$vs.loading()
            fetch(`https://api.resguru.app/api/tenant-receipts?filters[user_sign_contract][id][$eq]=${this.$route.query.profileId}&populate=*`)
                .then(response => response.json())
                .then((resp) => {
                    console.log("Return from getReceipt()",resp.data);
                    this.userReceipt = resp.data
                }).finally(() => {
                    loading.close()
                })

        },
        getEvidence(){
            const loading = this.$vs.loading()
            fetch(`https://api.resguru.app/api/tenant-evidence-payments?filters[user_sign_contract][id][$eq]=${this.$route.query.profileId}&populate=*`)
            // fetch(`https://api.resguru.app/api/tenant-evidence-payments`)
               .then(response => response.json())
                .then((resp) => {
                    console.log("Return from getEvidence()",resp.data);
                    this.userEvidencePayment = resp.data
                }).finally(() => {
                    loading.close()
                })

        },
        generateReNumber(){
            var result =  this.userBuilding.attributes.receiptNumber
            if (result != null || result != 0){
                result = "RE-" + new Date().getFullYear().toString().substr(-2) + (result+1).toString().padStart(5, '0')
            } else {
                result = "RE-" + new Date().getFullYear().toString().substr(-2) + "00001"
            }
            // console.log("generateReNumber", result)
            return result
        },
        setUploadFilePayment() {
            this.file = this.$refs.PartialPayment.files[0]
        },
        setUploadFileFullPayment() {
            this.fileFullPayment = this.$refs.FullPayment.files[0]
        },
        updateEvidence(){
            axios.put('https://api.resguru.app/api/tenant-evidence-payments/' + this.userEvidencePayment[0].id, {
                data: {
                    evidenceStatus: "Approve"
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Evidence Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })

        },
        updateInvoice(){
            axios.put('https://api.resguru.app/api/tenant-bills/' + this.userInvoice[0].id, {
                data: {
                    paymentStatus: "Paid",
                    paid: this.userEvidencePayment[0].attributes.amount
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Update Invoice Success')
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
                // console.log(this.userInvoice[0])
                // console.log(this.userEvidencePayment[0].attributes)
        },
        createReceipt(data){
            axios.post('https://api.resguru.app/api' + '/tenant-receipts', {
                data: {
                    // date_execute: this.date_execute,
                    tenant_bill: data.attributes.tenant_bill.data.id,
                    user_sign_contract: data.attributes.user_sign_contract.data.id,
                    paidAmount: data.attributes.amount,
                    receiptNumber: "RE_" +  data.attributes.tenant_bill.data.attributes.invoiceNumber,
                    //roomPrice: data.attributes.roomPrice,
                    //waterPrice: data.attributes.waterPrice,
                    //electricPrice: data.attributes.electricPrice,
                    //communalPrice: data.attributes.communalPrice,
                    //otherPrice: data.attributes.otherPrice,
                    //subTotal: data.attributes.subtotal,
                    //vat: data.attributes.vat,
                    //total: data.attributes.total,
                    building: data.attributes.building.data.id,
                    tenant_evidence_payment: data.id,
                    tenant_evidence_payment_receipt: data.id
                }
            })
            .then( (res) => {
                this.$showNotification('#3A89CB', 'Create Receipt Success')
                updateEvidence()
                updateInvoice()
                }   
            )
            .catch(error => {
                const errorMessage = error.message ? error.message : 'Error updating information';
                this.$showNotification('danger', errorMessage); 
            })
        },
        async PDFPrintReceipt(tr){
            this.$refs.childComponentPDFReceipt.generatePDF(tr)
        },
        async PDFPrint(){
                // Fetch an existing PDF document
                const url = 'https://api.resguru.app/uploads/Res_Guru_Invoice_958f9f65e6.pdf'
                    const existingPdfBytes = await fetch(url).then(res => res.arrayBuffer())
                // Load a PDFDocument from the existing PDF bytes
                const pdfDoc = await PDFDocument.load(existingPdfBytes)

                // Embed the Helvetica font
                const helveticaFont = await pdfDoc.embedFont(StandardFonts.Helvetica)

                // Get the first page of the document
                const pages = pdfDoc.getPages()
                const firstPage = pages[0]

                // Get the width and height of the first page
                const { width, height } = firstPage.getSize()

                // Draw a string of text diagonally across the first page
                firstPage.drawText('Work in progress', {
                    x: 5,
                    y: height / 2 + 300,
                    size: 50,
                    font: helveticaFont,
                    color: rgb(0.95, 0.1, 0.1),
                    rotate: degrees(-45),
                })

                // Serialize the PDFDocument to bytes (a Uint8Array)
                const pdfBytes = await pdfDoc.save()

                        // Trigger the browser to download the PDF document
                download(pdfBytes, "pdf-lib_modification_example.pdf", "application/pdf");
        },
    }
}
</script>
