<template>
    <div class="p-[20px] pt-[20px]">
        <div class="h-[auto] bg-[white] rounded-[12px] pt-[8px] pb-[8px] pl-[28px] pr-[28px] flex flex-col justify-end">
            <div class="flex justify-between">
                <div class="flex">
                    <div><svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_633_15105" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                width="41" height="41">
                                <rect width="41" height="41" fill="#D9D9D9" />
                            </mask>
                            <g mask="url(#mask0_633_15105)">
                                <path
                                    d="M12.5838 28.6138H15.1463V20.4993H12.5838V28.6138ZM25.8562 28.6138H28.4187V11.9576H25.8562V28.6138ZM19.2201 28.6138H21.7825V23.916H19.2201V28.6138ZM19.2201 20.4993H21.7825V17.0826H19.2201V20.4993ZM9.06862 35.0201C8.20569 35.0201 7.47526 34.7211 6.87734 34.1232C6.27943 33.5253 5.98047 32.7949 5.98047 31.9319V9.06667C5.98047 8.20373 6.27943 7.47331 6.87734 6.87539C7.47526 6.27747 8.20569 5.97852 9.06862 5.97852H31.9339C32.7968 5.97852 33.5273 6.27747 34.1252 6.87539C34.7231 7.47331 35.0221 8.20373 35.0221 9.06667V31.9319C35.0221 32.7949 34.7231 33.5253 34.1252 34.1232C33.5273 34.7211 32.7968 35.0201 31.9339 35.0201H9.06862ZM9.06862 32.4576H31.9339C32.0653 32.4576 32.1858 32.4029 32.2953 32.2934C32.4048 32.1838 32.4596 32.0634 32.4596 31.9319V9.06667C32.4596 8.93524 32.4048 8.81476 32.2953 8.70523C32.1858 8.59573 32.0653 8.54097 31.9339 8.54097H9.06862C8.9372 8.54097 8.81671 8.59573 8.70718 8.70523C8.59768 8.81476 8.54293 8.93524 8.54293 9.06667V31.9319C8.54293 32.0634 8.59768 32.1838 8.70718 32.2934C8.81671 32.4029 8.9372 32.4576 9.06862 32.4576Z"
                                    fill="#003765" />
                            </g>
                        </svg>
                    </div>
                    <div class="text-[24px] font-bold flex items-center ml-[8px]">ภาพรวมรายรับ-รายจ่าย</div>
                </div>
                <div class="flex items-center">
                    <div
                        class="h-[36px] pl-[8px] pr-[8px] bg-[#003765] flex cursor-pointer  justify-center items-center rounded-[12px]">
                        <div class="flex justify-center items-center">
                            <svg width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <mask id="mask0_528_31525" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                    width="22" height="22">
                                    <rect width="22" height="22" fill="#D9D9D9" />
                                </mask>
                                <g mask="url(#mask0_528_31525)">
                                    <path
                                        d="M4.86604 19.7084C4.403 19.7084 4.01107 19.548 3.69023 19.2272C3.3694 18.9063 3.20898 18.5144 3.20898 18.0514V5.78219C3.20898 5.31915 3.3694 4.92721 3.69023 4.60638C4.01107 4.28555 4.403 4.12513 4.86604 4.12513H6.13528V2.89114C6.13528 2.69019 6.20257 2.52243 6.33713 2.38786C6.47168 2.25331 6.63944 2.18604 6.84041 2.18604C7.04135 2.18604 7.20911 2.25331 7.34368 2.38786C7.47823 2.52243 7.54551 2.69019 7.54551 2.89114V4.12513H14.491V2.87351C14.491 2.67843 14.5568 2.51508 14.6884 2.38346C14.82 2.25184 14.9834 2.18604 15.1785 2.18604C15.3736 2.18604 15.5369 2.25184 15.6685 2.38346C15.8002 2.51508 15.866 2.67843 15.866 2.87351V4.12513H17.1352C17.5983 4.12513 17.9902 4.28555 18.311 4.60638C18.6319 4.92721 18.7923 5.31915 18.7923 5.78219V18.0514C18.7923 18.5144 18.6319 18.9063 18.311 19.2272C17.9902 19.548 17.5983 19.7084 17.1352 19.7084H4.86604ZM4.86604 18.3334H17.1352C17.2057 18.3334 17.2704 18.3041 17.3292 18.2453C17.3879 18.1865 17.4173 18.1219 17.4173 18.0514V9.44885H4.58396V18.0514C4.58396 18.1219 4.61334 18.1865 4.6721 18.2453C4.73087 18.3041 4.79552 18.3334 4.86604 18.3334ZM4.58396 8.07388H17.4173V5.78219C17.4173 5.71167 17.3879 5.64702 17.3292 5.58824C17.2704 5.52949 17.2057 5.50011 17.1352 5.50011H4.86604C4.79552 5.50011 4.73087 5.52949 4.6721 5.58824C4.61334 5.64702 4.58396 5.71167 4.58396 5.78219V8.07388ZM11.0006 12.904C10.7762 12.904 10.5849 12.8249 10.4268 12.6669C10.2688 12.5088 10.1897 12.3175 10.1897 12.0931C10.1897 11.8686 10.2688 11.6773 10.4268 11.5193C10.5849 11.3612 10.7762 11.2822 11.0006 11.2822C11.2251 11.2822 11.4164 11.3612 11.5744 11.5193C11.7325 11.6773 11.8115 11.8686 11.8115 12.0931C11.8115 12.3175 11.7325 12.5088 11.5744 12.6669C11.4164 12.8249 11.2251 12.904 11.0006 12.904ZM7.33396 12.904C7.1095 12.904 6.91824 12.8249 6.76017 12.6669C6.60211 12.5088 6.52308 12.3175 6.52308 12.0931C6.52308 11.8686 6.60211 11.6773 6.76017 11.5193C6.91824 11.3612 7.1095 11.2822 7.33396 11.2822C7.55842 11.2822 7.74968 11.3612 7.90775 11.5193C8.06581 11.6773 8.14484 11.8686 8.14484 12.0931C8.14484 12.3175 8.06581 12.5088 7.90775 12.6669C7.74968 12.8249 7.55842 12.904 7.33396 12.904ZM14.6673 12.904C14.4428 12.904 14.2516 12.8249 14.0935 12.6669C13.9354 12.5088 13.8564 12.3175 13.8564 12.0931C13.8564 11.8686 13.9354 11.6773 14.0935 11.5193C14.2516 11.3612 14.4428 11.2822 14.6673 11.2822C14.8918 11.2822 15.083 11.3612 15.2411 11.5193C15.3991 11.6773 15.4782 11.8686 15.4782 12.0931C15.4782 12.3175 15.3991 12.5088 15.2411 12.6669C15.083 12.8249 14.8918 12.904 14.6673 12.904ZM11.0006 16.5001C10.7762 16.5001 10.5849 16.4211 10.4268 16.263C10.2688 16.1049 10.1897 15.9137 10.1897 15.6892C10.1897 15.4648 10.2688 15.2735 10.4268 15.1154C10.5849 14.9574 10.7762 14.8783 11.0006 14.8783C11.2251 14.8783 11.4164 14.9574 11.5744 15.1154C11.7325 15.2735 11.8115 15.4648 11.8115 15.6892C11.8115 15.9137 11.7325 16.1049 11.5744 16.263C11.4164 16.4211 11.2251 16.5001 11.0006 16.5001ZM7.33396 16.5001C7.1095 16.5001 6.91824 16.4211 6.76017 16.263C6.60211 16.1049 6.52308 15.9137 6.52308 15.6892C6.52308 15.4648 6.60211 15.2735 6.76017 15.1154C6.91824 14.9574 7.1095 14.8783 7.33396 14.8783C7.55842 14.8783 7.74968 14.9574 7.90775 15.1154C8.06581 15.2735 8.14484 15.4648 8.14484 15.6892C8.14484 15.9137 8.06581 16.1049 7.90775 16.263C7.74968 16.4211 7.55842 16.5001 7.33396 16.5001ZM14.6673 16.5001C14.4428 16.5001 14.2516 16.4211 14.0935 16.263C13.9354 16.1049 13.8564 15.9137 13.8564 15.6892C13.8564 15.4648 13.9354 15.2735 14.0935 15.1154C14.2516 14.9574 14.4428 14.8783 14.6673 14.8783C14.8918 14.8783 15.083 14.9574 15.2411 15.1154C15.3991 15.2735 15.4782 15.4648 15.4782 15.6892C15.4782 15.9137 15.3991 16.1049 15.2411 16.263C15.083 16.4211 14.8918 16.5001 14.6673 16.5001Z"
                                        fill="white" />
                                </g>
                            </svg>
                        </div>
                        <div class="text-white font-bold ml-[8px]   flex justify-center items-center">พฤษภาคม/2023
                        </div>
                    </div>
                </div>
            </div>
        </div>
        <div
            class="h-[auto] mt-[24px] bg-[white] rounded-[12px] pt-[8px] pb-[8px] pl-[28px] pr-[28px] flex flex-col justify-end">
            <div class="">
                <div class="flex">
                    <div><svg width="41" height="41" viewBox="0 0 41 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_633_15105" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                width="41" height="41">
                                <rect width="41" height="41" fill="#D9D9D9" />
                            </mask>
                            <g mask="url(#mask0_633_15105)">
                                <path
                                    d="M12.5838 28.6138H15.1463V20.4993H12.5838V28.6138ZM25.8562 28.6138H28.4187V11.9576H25.8562V28.6138ZM19.2201 28.6138H21.7825V23.916H19.2201V28.6138ZM19.2201 20.4993H21.7825V17.0826H19.2201V20.4993ZM9.06862 35.0201C8.20569 35.0201 7.47526 34.7211 6.87734 34.1232C6.27943 33.5253 5.98047 32.7949 5.98047 31.9319V9.06667C5.98047 8.20373 6.27943 7.47331 6.87734 6.87539C7.47526 6.27747 8.20569 5.97852 9.06862 5.97852H31.9339C32.7968 5.97852 33.5273 6.27747 34.1252 6.87539C34.7231 7.47331 35.0221 8.20373 35.0221 9.06667V31.9319C35.0221 32.7949 34.7231 33.5253 34.1252 34.1232C33.5273 34.7211 32.7968 35.0201 31.9339 35.0201H9.06862ZM9.06862 32.4576H31.9339C32.0653 32.4576 32.1858 32.4029 32.2953 32.2934C32.4048 32.1838 32.4596 32.0634 32.4596 31.9319V9.06667C32.4596 8.93524 32.4048 8.81476 32.2953 8.70523C32.1858 8.59573 32.0653 8.54097 31.9339 8.54097H9.06862C8.9372 8.54097 8.81671 8.59573 8.70718 8.70523C8.59768 8.81476 8.54293 8.93524 8.54293 9.06667V31.9319C8.54293 32.0634 8.59768 32.1838 8.70718 32.2934C8.81671 32.4029 8.9372 32.4576 9.06862 32.4576Z"
                                    fill="#003765" />
                            </g>
                        </svg>
                    </div>
                    <div class="text-[18px] font-bold flex items-center ml-[8px]">รายรับ-รายจ่าย</div>
                </div>
                <div class="flex">
                    <div class="h-[36px] w-[132px] bg-[#003765] flex cursor-pointer  justify-center rounded-[12px] mt-[12px]"
                        @click="create = true">
                        <div class="flex justify-center items-center">
                            <svg width="14" height="13" viewBox="0 0 14 13" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    d="M6.99968 12.6875C6.8048 12.6875 6.64155 12.6216 6.50993 12.4898C6.37831 12.3581 6.3125 12.1948 6.3125 12V7.18746H1.49998C1.30519 7.18746 1.14191 7.12155 1.01016 6.98973C0.878385 6.8579 0.8125 6.69455 0.8125 6.49968C0.8125 6.3048 0.878385 6.14155 1.01016 6.00993C1.14191 5.87831 1.30519 5.8125 1.49998 5.8125H6.3125V0.999977C6.3125 0.805185 6.37841 0.641904 6.51023 0.510133C6.64206 0.378378 6.80541 0.3125 7.00028 0.3125C7.19516 0.3125 7.35841 0.378378 7.49003 0.510133C7.62165 0.641904 7.68745 0.805185 7.68745 0.999977V5.8125H12.5C12.6948 5.8125 12.8581 5.87841 12.9898 6.01023C13.1216 6.14206 13.1875 6.30541 13.1875 6.50028C13.1875 6.69516 13.1216 6.85841 12.9898 6.99003C12.8581 7.12164 12.6948 7.18746 12.5 7.18746H7.68745V12C7.68745 12.1948 7.62155 12.3581 7.48973 12.4898C7.3579 12.6216 7.19455 12.6875 6.99968 12.6875Z"
                                    fill="white" />
                            </svg>
                        </div>
                        <div @click="create = true"
                            class="text-white font-bold ml-[8px]   flex justify-center items-center">เพิ่มรายจ่าย</div>
                    </div>
                    <vs-tooltip bottom shadow not-hover v-model="popup_filter">
                        <div @click="popup_filter = true"
                            class="h-[36px] w-[132px]  flex  justify-center rounded-[12px] mt-[12px] ml-[14px] cursor-pointer">
                            <div class="flex justify-center items-center">
                                <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                    xmlns="http://www.w3.org/2000/svg">
                                    <mask id="mask0_3262_4178" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                        y="0" width="22" height="23">
                                        <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                    </mask>
                                    <g mask="url(#mask0_3262_4178)">
                                        <path
                                            d="M10.0846 16.7707C9.88982 16.7707 9.72655 16.7048 9.59479 16.573C9.46302 16.4411 9.39714 16.2778 9.39714 16.0829C9.39714 15.888 9.46302 15.7248 9.59479 15.5932C9.72655 15.4615 9.88982 15.3957 10.0846 15.3957H11.9179C12.1127 15.3957 12.276 15.4616 12.4078 15.5935C12.5395 15.7253 12.6054 15.8886 12.6054 16.0835C12.6054 16.2784 12.5395 16.4416 12.4078 16.5733C12.276 16.7049 12.1127 16.7707 11.9179 16.7707H10.0846ZM3.66795 7.25144C3.47315 7.25144 3.30988 7.18553 3.17813 7.05369C3.04635 6.92186 2.98047 6.75851 2.98047 6.56364C2.98047 6.36876 3.04635 6.20551 3.17813 6.07389C3.30988 5.94227 3.47315 5.87646 3.66795 5.87646H18.3346C18.5294 5.87646 18.6927 5.94238 18.8245 6.07421C18.9562 6.20603 19.0221 6.36938 19.0221 6.56426C19.0221 6.75913 18.9562 6.92237 18.8245 7.05399C18.6927 7.18563 18.5294 7.25144 18.3346 7.25144H3.66795ZM6.41795 12.0111C6.22315 12.0111 6.05988 11.9451 5.92813 11.8133C5.79635 11.6815 5.73047 11.5181 5.73047 11.3233C5.73047 11.1284 5.79635 10.9651 5.92813 10.8335C6.05988 10.7019 6.22315 10.6361 6.41795 10.6361H15.5846C15.7794 10.6361 15.9427 10.702 16.0745 10.8338C16.2062 10.9657 16.2721 11.129 16.2721 11.3239C16.2721 11.5188 16.2062 11.682 16.0745 11.8136C15.9427 11.9452 15.7794 12.0111 15.5846 12.0111H6.41795Z"
                                            fill="#003765" />
                                    </g>
                                </svg>
                            </div>
                            <div class=" font-bold ml-[8px] flex justify-center items-center">ฟิลเตอร์</div>
                        </div>
                        <template #tooltip>
                            <div class="w-[100%]">
                                <div class="center">
                                    <vs-checkbox v-model="option">
                                        <div class="text-custom">ห้องค้างชำระ</div>
                                    </vs-checkbox>
                                </div>
                                <div class="center">
                                    <vs-checkbox v-model="option">
                                        <div class="text-custom">ห้องชำระเงินแล้ว</div>
                                    </vs-checkbox>
                                </div>
                                <div class="center">
                                    <vs-checkbox v-model="option">
                                        <div class="text-custom">ห้องว่าง</div>
                                    </vs-checkbox>
                                </div>
                                <div class="center">
                                    <vs-checkbox v-model="option">
                                        <div class="text-custom">ห้องติดจอง</div>
                                    </vs-checkbox>
                                </div>
                                <div class="center">
                                    <vs-checkbox v-model="option">
                                        <div class="text-custom">ห้องไกล้หมดสัญญา</div>
                                    </vs-checkbox>
                                </div>
                                <div class="center">
                                    <vs-checkbox v-model="option">
                                        <div class="text-custom">ห้องแจ้งย้ายออก</div>
                                    </vs-checkbox>
                                </div>
                            </div>
                        </template>
                    </vs-tooltip>
                </div>
            </div>
            <div class="mt-[14px]">
                <vs-table>
                    <template #thead>
                        <vs-tr>
                            <vs-th>
                                วันที่
                            </vs-th>
                            <vs-th>
                                เลขที่ใบเสร็จ
                            </vs-th>
                            <vs-th>
                                รายละเอียด
                            </vs-th>
                            <vs-th>
                                ประเภท
                            </vs-th>
                            <vs-th>
                                จำนวนเงิน
                            </vs-th>
                        </vs-tr>
                    </template>
                    <template #tbody>
                        <vs-tr :key="i" v-for="(tr, i) in users" :data="tr">
                            <vs-td>
                                {{ tr.id }}
                            </vs-td>
                            <vs-td>
                                {{ tr.name }}
                            </vs-td>
                            <vs-td>
                                {{ tr.username }}
                            </vs-td>
                            <vs-td>
                                {{ tr.email }}
                            </vs-td>
                            <vs-td>
                                {{ tr.website }}
                            </vs-td>
                        </vs-tr>
                    </template>
                </vs-table>
            </div>
        </div>

        <!-- //////////////////////////// pop-up /////////////////////// -->
        <b-modal centered v-model="create" size="default" hide-backdrop hide-header-close hide-header hide-footer
            class="p-[-20px] text-custom">
            <div>
                <div class="flex justify-between pl-[20px] pr-[20px]">
                    <div class="text-custom flex justify-center items-center text-[18px] font-bold">เพิ่มรายจ่าย</div>
                    <div @click="create = false" class="cursor-pointer">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <mask id="mask0_417_4814" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0" y="0"
                                width="24" height="24">
                                <rect width="24" height="24" fill="#D9D9D9" />
                            </mask>
                            <g mask="url(#mask0_417_4814)">
                                <path
                                    d="M12.0005 13.0538L6.92737 18.1269C6.78892 18.2654 6.61489 18.3362 6.40527 18.3394C6.19567 18.3426 6.01844 18.2718 5.87357 18.1269C5.72869 17.982 5.65625 17.8064 5.65625 17.6C5.65625 17.3936 5.72869 17.218 5.87357 17.0731L10.9466 12L5.87357 6.92689C5.73511 6.78844 5.66427 6.6144 5.66107 6.40479C5.65786 6.19519 5.72869 6.01795 5.87357 5.87309C6.01844 5.7282 6.19407 5.65576 6.40047 5.65576C6.60687 5.65576 6.78251 5.7282 6.92737 5.87309L12.0005 10.9462L17.0736 5.87309C17.212 5.73462 17.3861 5.66379 17.5957 5.66059C17.8053 5.65737 17.9825 5.7282 18.1274 5.87309C18.2723 6.01795 18.3447 6.19359 18.3447 6.39999C18.3447 6.60639 18.2723 6.78202 18.1274 6.92689L13.0543 12L18.1274 17.0731C18.2658 17.2115 18.3367 17.3856 18.3399 17.5952C18.3431 17.8048 18.2723 17.982 18.1274 18.1269C17.9825 18.2718 17.8069 18.3442 17.6005 18.3442C17.3941 18.3442 17.2184 18.2718 17.0736 18.1269L12.0005 13.0538Z"
                                    fill="#5C6B79" />
                            </g>
                        </svg>
                    </div>
                </div>
                <!-- <div class="w-[100%] h-[1px]  mt-[24px] mb-[14px] bg-gray-200 border-0 dark:bg-gray-700"></div> -->
                <div class="pl-[20px] pr-[20px] mt-[24px]">
                    <div>
                        <div class="text-custom text-[14px] text-[#003765]">ประเภทรายจ่าย</div>
                        <div class="flex  items-center">
                            <vs-select placeholder="Select" v-model="value">
                                <vs-option label="Vuesax" value="1">
                                    Vuesax
                                </vs-option>
                            </vs-select>
                            <div class="ml-[8px]">
                               <input class="h-[36px] w-[100%] ml-[8px] bg-[#F3F8FD] rounded-[12px]  flex justify-start" type="input" /> 
                            </div>
                            
                        </div>


                    </div>
                    <div class="mt-[8px]">
                        <div class="text-custom text-[14px] text-[#003765]">หมายเหตุ</div>
                        <input class="h-[36px] w-[100%] bg-[#F3F8FD] rounded-[12px]  flex justify-start" type="input" />
                    </div>
                    <div class="mt-[14px]">
                        <div class="text-custom text-[14px] text-[#003765]">จำนวนเงิน (บาท)</div>
                        <input class="h-[36px] w-[100%] bg-[#F3F8FD] rounded-[12px]  flex justify-start" type="input" />
                    </div>
                    <div class="mt-[14px]">
                        <div class="text-custom text-[14px] text-[#003765]">วันที่</div>
                        <input class="h-[36px] w-[100%] bg-[#F3F8FD] rounded-[12px] pl-[14px] pr-[14px]  flex justify-start"
                            type="date" />
                    </div>
                    <div class="mt-[14px]">
                        <div class="text-custom text-[14px] text-[#003765]">หลักฐานการจ่ายเงิน</div>
                        <div class="flex mt-[4px]">
                            <div
                                class="flex justify-center text-custom items-center bg-[#165D98] text-[14px] text-[white] pt-[8px] pb-[8px] pl-[12px] pr-[12px] rounded-[12px]">
                                เลือกรูปภาพ</div>
                            <div class="text-[#5C6B79] text-custom  flex justify-center items-center ml-[8px] text-[12px]">
                                ยังไม่ได้เลือกไฟล์</div>
                        </div>
                    </div>
                    <div class="mt-[14px]">
                        <div class="text-custom text-[14px] text-[#003765]">ใบสำคัญจ่าย</div>
                        <div class="flex mt-[4px]">
                            <div
                                class="flex justify-center text-custom items-center bg-[#165D98] text-[14px] text-[white] pt-[8px] pb-[8px] pl-[12px] pr-[12px] rounded-[12px]">
                                เลือกรูปภาพ</div>
                            <div class="text-[#5C6B79] text-custom  flex justify-center items-center ml-[8px] text-[12px]">
                                ยังไม่ได้เลือกไฟล์</div>
                        </div>
                    </div>

                </div>
                <div class="flex justify-end mt-[30px]">
                    <div>
                        <vs-button dark shadow @click="ccreate = false">
                            <div class="text-custom">ยกเลิก</div>
                        </vs-button>
                    </div>
                    <div>
                        <vs-button @click="create = false" color="#003765">
                            <div class="text-custom">เพิ่ม</div>
                        </vs-button>
                    </div>
                </div>
            </div>
        </b-modal>
    </div>
</template>
<script>
export default {
    data() {
        return {
            create: false,
            popup_filter: false,
            users: [
                {
                    "id": "12/01/23",
                    "name": "ใบเสร็จค่าเช่ารายเดือน#202301000031",
                    "username": "ใบเสร็จค่าเช่า",
                    "email": "101",
                    "website": "1,000",
                },
                {
                    "id": "12/01/23",
                    "name": "ใบเสร็จค่าเช่ารายเดือน#202301000031",
                    "username": "ใบเสร็จค่าเช่า",
                    "email": "101",
                    "website": "1,000",
                },
                {
                    "id": "12/01/23",
                    "name": "ใบเสร็จค่าเช่ารายเดือน#202301000031",
                    "username": "ใบเสร็จค่าเช่า",
                    "email": "101",
                    "website": "1,000",
                },
                {
                    "id": "12/01/23",
                    "name": "ใบเสร็จค่าเช่ารายเดือน#202301000031",
                    "username": "ใบเสร็จค่าเช่า",
                    "email": "101",
                    "website": "1,000",
                },
            ]
        }

    },
    created() {
        const loading = this.$vs.loading({
            opacity: 1,
        })
        setTimeout(() => {
            loading.close()
        }, 1000)
    },
    methods: {
        routeTo(path) {
            this.$router.push({
                path: path,
            })
        },
    }


}
</script>
<style>
.text-custom {
    font-family: 'Prompt';
}

#mr {
    width: 90px;
}

/* .vs-select__input{
    height: 36px !important;
    width: 350px !important;
} */
</style>