<template>
    <div>
        <div class="bg-[white] pt-[14px] pl-[24px] pr-[24px] rounded-b-lg">
            <div class="bg-[white] ">
                <div class="flex justify-start items-center rounded-[12px] ">
                    <div class="bg-[#F3F7FA] rounded-[12px]">
                        <div class="flex justify-start items-center">
                            <div @click="tab = 1" class="cursor-pointer "
                                :class="tab == 1 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                                ผังห้อง</div>
                            <div @click="tab = 2" class="cursor-pointer ml-[8px]"
                                :class="tab == 2 ? 'bg-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] rounded-[12px] text-[white]' : 'text-[#003765] pl-[9px] pr-[9px] pt-[8px] pb-[8px] flex justify-center items-center'">
                                รายการประเภทห้องพัก
                            </div>
                        </div>
                    </div>
                </div>
                <div class="h-[auto] bg-[white] rounded-[12px] flex flex-col justify-end mt-[14px]">
                    <div>
                        <div class="flex">
                            <div class="h-[36px] pl-[8px] pr-[8px] bg-[#003765] flex cursor-pointer  justify-center rounded-[12px] mt-[12px]"
                                @click="create = true">
                                <div class="flex justify-start items-center">
                                    <svg width="20" height="20" viewBox="0 0 26 26" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <mask id="mask0_3458_20475" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                            y="0" width="26" height="26">
                                            <rect x="0.625" y="0.880859" width="24.75" height="24.75" fill="#D9D9D9" />
                                        </mask>
                                        <g mask="url(#mask0_3458_20475)">
                                            <path
                                                d="M8.95859 21.1275L10.0245 20.8419L15.8657 10.7136L14.514 9.93227L8.67271 20.0606L8.95859 21.1275ZM18.38 9.03688L14.6976 6.93096L15.5262 5.49429C15.7073 5.18019 15.9791 4.97457 16.3416 4.87744C16.7041 4.78032 17.0423 4.82248 17.3562 5.00392L18.708 5.78522C19.022 5.96667 19.2308 6.23319 19.3345 6.5848C19.4382 6.93641 19.3994 7.26927 19.2183 7.58337L18.38 9.03688ZM8.7915 22.5594C8.56937 22.6189 8.36405 22.5942 8.17554 22.4852C7.98703 22.3763 7.86299 22.2106 7.80342 21.9883L7.31926 20.1814C7.29139 20.0774 7.28365 19.9734 7.29603 19.8693C7.3084 19.7652 7.34411 19.6619 7.40316 19.5596L14.0098 8.10401L17.6994 10.2365L11.0927 21.692C11.0337 21.7944 10.9622 21.877 10.8784 21.9397C10.7945 22.0025 10.7006 22.0479 10.5967 22.0757L8.7915 22.5594Z"
                                                fill="white" />
                                        </g>
                                    </svg>
                                </div>
                                <div @click="create = true"
                                    class="text-white font-bold ml-[4px]   flex justify-center items-center">แก้ไขผังห้องพัก
                                </div>
                            </div>
                            <div @click="popup_filter = true"
                                class="h-[36px]  flex  justify-center rounded-[12px] mt-[12px] ml-[28px] cursor-pointer">
                                <div class="flex justify-center items-center">
                                    <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <mask id="mask0_3458_11720" style="mask-type:alpha" maskUnits="userSpaceOnUse" x="0"
                                            y="0" width="22" height="23">
                                            <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                        </mask>
                                        <g mask="url(#mask0_3458_11720)">
                                            <path
                                                d="M5.95961 14.4256H16.0429V15.2894C16.0429 15.4469 16.0947 15.5773 16.1981 15.6807C16.3015 15.7841 16.4319 15.8358 16.5894 15.8358C16.7469 15.8358 16.8773 15.7841 16.9807 15.6807C17.0842 15.5773 17.1359 15.4469 17.1359 15.2894V12.5006C17.1359 12.2209 17.0748 11.9456 16.9525 11.6747C16.8303 11.4038 16.6623 11.1761 16.4484 10.9916V9.13717C16.4484 8.67415 16.288 8.28222 15.9671 7.96138C15.6463 7.64055 15.2544 7.48013 14.7913 7.48013H11.9708C11.7675 7.48013 11.5851 7.51333 11.4235 7.57973C11.2619 7.64614 11.1212 7.73987 11.0013 7.86092C10.8814 7.73987 10.7407 7.64614 10.5791 7.57973C10.4175 7.51333 10.235 7.48013 10.0317 7.48013H7.21123C6.74819 7.48013 6.35626 7.64055 6.03542 7.96138C5.7146 8.28222 5.55419 8.67415 5.55419 9.13717V10.9916C5.34031 11.1761 5.17225 11.4038 5.05003 11.6747C4.92781 11.9456 4.86669 12.2209 4.86669 12.5006V15.2894C4.86669 15.4469 4.9184 15.5773 5.02182 15.6807C5.12523 15.7841 5.25567 15.8358 5.41314 15.8358C5.57063 15.8358 5.70108 15.7841 5.80449 15.6807C5.90791 15.5773 5.95961 15.4469 5.95961 15.2894V14.4256ZM5.95961 13.3327V12.416C5.95961 12.1563 6.04746 11.9386 6.22315 11.7629C6.39885 11.5872 6.61656 11.4993 6.87628 11.4993H15.1263C15.386 11.4993 15.6037 11.5872 15.7794 11.7629C15.9551 11.9386 16.0429 12.1563 16.0429 12.416V13.3327H5.95961ZM6.64711 10.4064V8.85513C6.64711 8.77286 6.67356 8.70528 6.72645 8.65239C6.77934 8.59951 6.84692 8.57308 6.92919 8.57308H10.1728C10.255 8.57308 10.3226 8.59951 10.3755 8.65239C10.4284 8.70528 10.4548 8.77286 10.4548 8.85513V10.4064H6.64711ZM11.5478 10.4064V8.85513C11.5478 8.77286 11.5742 8.70528 11.6271 8.65239C11.68 8.59951 11.7475 8.57308 11.8298 8.57308H15.0734C15.1556 8.57308 15.2232 8.59951 15.2761 8.65239C15.329 8.70528 15.3554 8.77286 15.3554 8.85513V10.4064H11.5478ZM3.95003 20.2076C3.48699 20.2076 3.09505 20.0472 2.77422 19.7264C2.45339 19.4056 2.29297 19.0136 2.29297 18.5506V4.44808C2.29297 3.98504 2.45339 3.5931 2.77422 3.27227C3.09505 2.95143 3.48699 2.79102 3.95003 2.79102H18.0525C18.5156 2.79102 18.9075 2.95143 19.2283 3.27227C19.5492 3.5931 19.7096 3.98504 19.7096 4.44808V18.5506C19.7096 19.0136 19.5492 19.4056 19.2283 19.7264C18.9075 20.0472 18.5156 20.2076 18.0525 20.2076H3.95003ZM3.95003 18.8327H18.0525C18.1231 18.8327 18.1877 18.8033 18.2465 18.7445C18.3052 18.6858 18.3346 18.6211 18.3346 18.5506V4.44808C18.3346 4.37755 18.3052 4.3129 18.2465 4.25413C18.1877 4.19537 18.1231 4.16599 18.0525 4.16599H3.95003C3.87951 4.16599 3.81486 4.19537 3.75608 4.25413C3.69733 4.3129 3.66795 4.37755 3.66795 4.44808V18.5506C3.66795 18.6211 3.69733 18.6858 3.75608 18.7445C3.81486 18.8033 3.87951 18.8327 3.95003 18.8327Z"
                                                fill="#003765" />
                                        </g>
                                    </svg>
                                </div>
                                <div class=" font-bold ml-[8px] flex justify-center items-center">กำหนดประเภทห้องและค่าเช่า
                                </div>
                            </div>
                            <!-- <vs-tooltip bottom shadow not-hover v-model="popup_filter">
                                <div @click="popup_filter = true"
                                    class="h-[36px] w-[132px]  flex  justify-center rounded-[12px] mt-[12px] ml-[14px] cursor-pointer">
                                    <div class="flex justify-center items-center">
                                        <svg width="22" height="23" viewBox="0 0 22 23" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <mask id="mask0_3262_4178" style="mask-type:alpha" maskUnits="userSpaceOnUse"
                                                x="0" y="0" width="22" height="23">
                                                <rect y="0.5" width="22" height="22" fill="#D9D9D9" />
                                            </mask>
                                            <g mask="url(#mask0_3262_4178)">
                                                <path
                                                    d="M10.0846 16.7707C9.88982 16.7707 9.72655 16.7048 9.59479 16.573C9.46302 16.4411 9.39714 16.2778 9.39714 16.0829C9.39714 15.888 9.46302 15.7248 9.59479 15.5932C9.72655 15.4615 9.88982 15.3957 10.0846 15.3957H11.9179C12.1127 15.3957 12.276 15.4616 12.4078 15.5935C12.5395 15.7253 12.6054 15.8886 12.6054 16.0835C12.6054 16.2784 12.5395 16.4416 12.4078 16.5733C12.276 16.7049 12.1127 16.7707 11.9179 16.7707H10.0846ZM3.66795 7.25144C3.47315 7.25144 3.30988 7.18553 3.17813 7.05369C3.04635 6.92186 2.98047 6.75851 2.98047 6.56364C2.98047 6.36876 3.04635 6.20551 3.17813 6.07389C3.30988 5.94227 3.47315 5.87646 3.66795 5.87646H18.3346C18.5294 5.87646 18.6927 5.94238 18.8245 6.07421C18.9562 6.20603 19.0221 6.36938 19.0221 6.56426C19.0221 6.75913 18.9562 6.92237 18.8245 7.05399C18.6927 7.18563 18.5294 7.25144 18.3346 7.25144H3.66795ZM6.41795 12.0111C6.22315 12.0111 6.05988 11.9451 5.92813 11.8133C5.79635 11.6815 5.73047 11.5181 5.73047 11.3233C5.73047 11.1284 5.79635 10.9651 5.92813 10.8335C6.05988 10.7019 6.22315 10.6361 6.41795 10.6361H15.5846C15.7794 10.6361 15.9427 10.702 16.0745 10.8338C16.2062 10.9657 16.2721 11.129 16.2721 11.3239C16.2721 11.5188 16.2062 11.682 16.0745 11.8136C15.9427 11.9452 15.7794 12.0111 15.5846 12.0111H6.41795Z"
                                                    fill="#003765" />
                                            </g>
                                        </svg>
                                    </div>
                                    <div class=" font-bold ml-[8px] flex justify-center items-center">ฟิลเตอร์</div>
                                </div>
                                <template #tooltip>
                                    <div class="w-[100%]">
                                        <div class="center">
                                            <vs-checkbox v-model="option">
                                                <div class="text-custom">ห้องค้างชำระ</div>
                                            </vs-checkbox>
                                        </div>
                                        <div class="center">
                                            <vs-checkbox v-model="option">
                                                <div class="text-custom">ห้องชำระเงินแล้ว</div>
                                            </vs-checkbox>
                                        </div>
                                        <div class="center">
                                            <vs-checkbox v-model="option">
                                                <div class="text-custom">ห้องว่าง</div>
                                            </vs-checkbox>
                                        </div>
                                        <div class="center">
                                            <vs-checkbox v-model="option">
                                                <div class="text-custom">ห้องติดจอง</div>
                                            </vs-checkbox>
                                        </div>
                                        <div class="center">
                                            <vs-checkbox v-model="option">
                                                <div class="text-custom">ห้องไกล้หมดสัญญา</div>
                                            </vs-checkbox>
                                        </div>
                                        <div class="center">
                                            <vs-checkbox v-model="option">
                                                <div class="text-custom">ห้องแจ้งย้ายออก</div>
                                            </vs-checkbox>
                                        </div>
                                    </div>
                                </template>
                            </vs-tooltip> -->
                        </div>
                    </div>
                    <div class="flex items-center mb-[8px] mt-[14px]">
                        <div class="mr-[14px]">
                            <vs-select placeholder="เลือกอาคาร">
                                <vs-option label="อาคาร A" value="1">
                                    อาคาร A
                                </vs-option>
                                <vs-option label="อาคาร B" value="2">
                                    อาคาร B
                                </vs-option>
                            </vs-select>
                        </div>
                        <div class="mr-[14px] font-bold cursor-pointer">อาคาร A ชั้น 1</div>
                        <div class="text-[#8396A6] cursor-pointer">อาคาร A ชั้น 2</div>
                    </div>
                </div>
            </div>
        </div>
        <div class="mt-[24px] bg-[white] pt-[14px] pb-[24px] pl-[24px] pr-[24px] rounded-[12px]">
            <div class="text-[24px] font-bold">อาคาร A ชั้น 1</div>
            <div class="grid grid-cols-4 w-[100%] gap-4 mt-[14px] ">
                <div class="rounded-[16px]  p-[14px] h-[202px] border cursor-pointer">
                    <div class="flex justify-between">
                        <div class="text-[18px] font-bold text-[#003765]">ห้อง 101</div>
                        <div class="flex">
                            <vs-checkbox v-model="option" color="#003765"> </vs-checkbox>
                        </div>
                    </div>
                    <div class="mt-[24px]">
                        <div class="flex justify-between  h-[100%]">
                            <div class="text-[12px] text-[#5C6B79] flex items-center">ประเภทห้อง</div>
                            <div class="mt-[]">
                                <select placeholder="Select" v-model="value"
                                    class="w-[200px] h-[32px] border rounded-[12px] pl-[8px] pr-[8px]"
                                    :class="value == 1 ? 'bg-[#FFF2BC] text-[#EEA10B]' : ''">
                                    <option label="เลือก" value="0" disabled>
                                        เลือก
                                    </option>
                                    <option label="ห้องพร้อมเฟอร์นิเจอร์" value="1">
                                        ห้องพร้อมเฟอร์นิเจอร์
                                    </option>
                                </select>
                            </div>
                        </div>
                        <div class="grid grid-cols-2 w-[100%] gap-4 mt-[14px] ">
                            <div class="w-[100%]">
                                <vs-input v-model="value1">
                                    <template #icon>
                                        <svg width="24" height="25" viewBox="0 0 24 25" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <mask id="mask0_3458_19558" style="mask-type:alpha" maskUnits="userSpaceOnUse"
                                                x="0" y="0" width="24" height="25">
                                                <rect y="0.457031" width="24" height="24" fill="#D9D9D9" />
                                            </mask>
                                            <g mask="url(#mask0_3458_19558)">
                                                <path
                                                    d="M12 21.9568C10.0156 21.9568 8.26953 21.2642 6.76172 19.8791C5.25391 18.494 4.5 16.6197 4.5 14.2564C4.5 12.7695 5.06635 11.1524 6.19905 9.40494C7.33173 7.65751 9.04392 5.75508 11.3356 3.69767C11.4298 3.61792 11.5339 3.55625 11.648 3.51267C11.7621 3.46907 11.8795 3.44727 12 3.44727C12.1205 3.44727 12.2378 3.46907 12.3519 3.51267C12.466 3.55625 12.5701 3.61792 12.6643 3.69767C14.956 5.75508 16.6682 7.65751 17.8009 9.40494C18.9336 11.1524 19.5 12.7695 19.5 14.2564C19.5 16.6197 18.746 18.494 17.2382 19.8791C15.7304 21.2642 13.9843 21.9568 12 21.9568ZM12 20.4568C13.6769 20.4568 15.0961 19.8802 16.2577 18.727C17.4192 17.5738 18 16.0838 18 14.2568C18 13.0735 17.5083 11.7193 16.525 10.1943C15.5416 8.66934 14.0333 6.97351 12 5.10684C9.96664 6.97351 8.45831 8.66934 7.47497 10.1943C6.49164 11.7193 5.99997 13.0735 5.99997 14.2568C5.99997 16.0838 6.58074 17.5738 7.74227 18.727C8.90382 19.8802 10.3231 20.4568 12 20.4568ZM12.2461 19.303C12.4205 19.2863 12.5641 19.2211 12.6769 19.1073C12.7897 18.9935 12.8461 18.8563 12.8461 18.6957C12.8461 18.5082 12.7846 18.3597 12.6617 18.2501C12.5387 18.1405 12.3816 18.094 12.1903 18.1107C11.507 18.1607 10.7628 17.9604 9.95765 17.5097C9.15253 17.0591 8.64997 16.2754 8.44997 15.1588C8.41664 14.9882 8.34517 14.8543 8.23555 14.7568C8.12593 14.6594 7.99548 14.6107 7.8442 14.6107C7.66215 14.6107 7.51055 14.679 7.3894 14.8155C7.26825 14.952 7.22948 15.1274 7.27308 15.3415C7.54358 16.794 8.19742 17.8325 9.2346 18.4568C10.2718 19.0812 11.2756 19.3632 12.2461 19.303Z"
                                                    fill="#003765" />
                                            </g>
                                        </svg>
                                    </template>
                                </vs-input>
                            </div>
                            <div class="w-[100%]">
                                <vs-input v-model="value1" id="ii">
                                    <template #icon>
                                        <svg width="24" height="25" viewBox="0 0 24 25" fill="none"
                                            xmlns="http://www.w3.org/2000/svg">
                                            <mask id="mask0_3458_17710" style="mask-type:alpha" maskUnits="userSpaceOnUse"
                                                x="0" y="0" width="24" height="25">
                                                <rect y="0.457031" width="24" height="24" fill="#D9D9D9" />
                                            </mask>
                                            <g mask="url(#mask0_3458_17710)">
                                                <path
                                                    d="M11.6643 17.557L14.5908 12.5916C14.6181 12.5403 14.6208 12.4874 14.599 12.4329C14.5772 12.3784 14.539 12.3512 14.4845 12.3512H12.1011L13.5897 6.27433C13.6115 6.19741 13.6006 6.1253 13.557 6.05798C13.5133 5.99066 13.4588 5.95701 13.3934 5.95701H9.53769C9.46134 5.95701 9.39863 5.98586 9.34957 6.04356C9.30048 6.10126 9.27594 6.17498 9.27594 6.26473V13.6493C9.27594 13.739 9.30048 13.8128 9.34957 13.8705C9.39863 13.9282 9.46134 13.957 9.53769 13.957H11.6643V17.557ZM15.9093 12.9704L11.4434 20.5877C11.3638 20.7248 11.2649 20.8152 11.1465 20.8588C11.0282 20.9024 10.9107 20.9024 10.794 20.8588C10.6773 20.8152 10.5806 20.7357 10.5037 20.6204C10.4268 20.505 10.3883 20.3652 10.3883 20.2011V15.457H9.53769C9.11347 15.457 8.75113 15.2804 8.45067 14.9272C8.15022 14.574 8 14.148 8 13.6493V6.26473C8 5.76601 8.15022 5.34006 8.45067 4.98686C8.75113 4.63364 9.11347 4.45703 9.53769 4.45703H13.6551C14.076 4.45703 14.4179 4.64453 14.6807 5.01953C14.9436 5.39453 15.021 5.8096 14.913 6.26473L13.7909 10.8512H14.9523C15.4136 10.8512 15.7547 11.0906 15.9755 11.5695C16.1964 12.0483 16.1743 12.5153 15.9093 12.9704Z"
                                                    fill="#003765" />
                                            </g>
                                        </svg>
                                    </template>
                                </vs-input>
                            </div>
                        </div>
                        <div
                            class="flex pl-[8px] pr-[8px] pt-[4px] pb-[4px] rounded-[12px] border justify-between mt-[8px] text-[#0B9A3C]">
                            <div>ราคา</div>
                            <div>3500</div>
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data() {
        return {
            tab: 2,
            value: 0

        }
    }
}

</script>
<style  >.vs-input {
    width: 100% !important;
}</style>